[{"publishedAt":"2022-07-01T12:57:00Z","author":null,"urlToImage":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/1/trudeau-canada-day-message-1-5970969-1656683441974.png","description":"<ol><li>In Canada Day message, Trudeau says Canadian flag represents promise of a better life  CTV News\r\n<\/li><li>'A promise'; Trudeau delivers hopeful message to nation on Canada Day - Canada News  Castanet.net\r\n<\/li><li>'Today we celebrate the country we lo…","source":{"name":"Ctvnews.ca","id":null},"title":"In Canada Day message, Trudeau says Canadian flag represents promise of a better life - CTV News","url":"https://www.ctvnews.ca/politics/in-canada-day-message-trudeau-says-canadian-flag-represents-promise-of-a-better-life-1.5970940","content":"Ottawa - \r\nPrime Minister Justin Trudeau called for unity amid a potentially divisive national holiday on Friday, using his official Canada Day address to call for deepened commitment to Canadian val… [+3666 chars]"},{"publishedAt":"2022-06-15T19:45:03Z","author":"Amrita Khalid","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/608e0350-ecdd-11ec-b2b6-8e7563e769d4","description":"Disney+ is continuing its experiment with live events\r\n, this time with a special from one of its own theme parks. The platform will livestream Harmonious Live!, a musical special that will be hosted by Idina Menzel and performed at the Epcot theme park in Wa…","source":{"name":"Engadget","id":"engadget"},"title":"Disney+ will stream a live musical special from Epcot hosted by Idina Menzel","url":"https://www.engadget.com/disney-to-livestream-epcots-harmonious-live-with-idina-menzel-194503660.html","content":"Disney+ is continuing its experiment with live events\r\n, this time with a special from one of its own theme parks. The platform will livestream Harmonious Live!, a musical special that will be hosted… [+971 chars]"},{"publishedAt":"2022-06-24T13:45:27Z","author":"Jon Fingas","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/00f97310-f3b9-11ec-be7f-3a74840835ce","description":"Twitch has been tightening its content policies in recent months, and that now includes mentions of self-harm. The livestreaming service has updated its Community Guidelines to include examples of the self-harm behavior it doesn't allow. The clarified policy …","source":{"name":"Engadget","id":"engadget"},"title":"Twitch clarifies its self-harm policy","url":"https://www.engadget.com/twitch-self-harm-policy-update-134527571.html","content":"Twitch has been tightening its content policies in recent months, and that now includes mentions of self-harm. The livestreaming service has updated its Community Guidelines to include examples of th… [+1263 chars]"},{"publishedAt":"2022-06-09T13:00:19Z","author":"Jon Fingas","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/6567e910-e763-11ec-a39f-adc751caaef3","description":"Amazon already uses augmented reality to help you try hair colors and makeup, and now it's extending that technology to your feet. The company has launched a Virtual Try-On for Shoes feature in its mobile app that helps you visualize footwear. Tap a button on…","source":{"name":"Engadget","id":"engadget"},"title":"Amazon's AR try-ons can show how shoes look, but not how they fit","url":"https://www.engadget.com/amazon-virtual-try-on-shoes-ar-130019101.html","content":"Amazon already uses augmented reality to help you try hair colors and makeup, and now it's extending that technology to your feet. The company has launched a Virtual Try-On for Shoes feature in its m… [+1137 chars]"},{"publishedAt":"2022-07-07T22:13:48Z","author":"Leyland Cecco in Toronto","urlToImage":"https://i.guim.co.uk/img/media/9f8fa5414030699f895cea0d42aa073037e9e3c3/0_28_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d8bfad7bf93a57ca068baddce790f50d","description":"Experts warn that RCMP document detailing covert surveillance of Canadians’ mobile devices highlights lax government oversightAn admission from Canada’s national police force that it routinely uses powerful spyware to surveil citizens has prompted concern fro…","source":{"name":"The Guardian","id":null},"title":"‘Asleep at the wheel’: Canada police’s spyware admission raises alarm","url":"https://amp.theguardian.com/world/2022/jul/07/canada-police-spyware-admission-surveillance-experts","content":"An admission from Canadas national police force that it routinely uses powerful spyware to surveil citizens has prompted concern from experts, who warn the country is asleep at the wheel when it come… [+5691 chars]"}]