[{"publishedAt":"2022-06-07T23:38:09Z","author":"Claire Shaffer","urlToImage":"https://static01.nyt.com/images/2022/06/07/arts/sexplanation1/sexplanation1-facebookJumbo.jpg","description":"The director Alex Liu explores the politics and culture of sex ed in the United States while confronting his own shame around sexuality.","source":{"name":"New York Times","id":null},"title":"‘A Sexplanation’ Review: Sex Education Fit for a Classroom","url":"https://www.nytimes.com/2022/06/07/movies/a-sexplanation-review.html","content":"The debate around American sex education doesnt get much more personal than A Sexplanation, an insightful documentary in which the director Alex Liu explores the politics and culture of sex ed in the… [+1127 chars]"},{"publishedAt":"2022-06-08T14:13:38Z","author":"LAURAN NEERGAARD / AP","urlToImage":"https://api.time.com/wp-content/uploads/2022/06/novovax-vaccine.jpg?quality=85&w=1024&h=628&crop=1","description":"American adults who haven’t yet gotten vaccinated against COVID-19 may soon get another choice, as advisers to the Food and Drug Administration on Tuesday backed a more traditional type of shot. Next, the FDA must decide whether to authorize the protein vacci…","source":{"name":"Time","id":"time"},"title":"A Fourth COVID-19 Vaccine, From Novovax, Passed a Key Stage in the Authorization Process","url":"https://time.com/6185434/novovax-covid-19-vaccine-fda-advisers/","content":"American adults who haven’t yet gotten vaccinated against COVID-19 may soon get another choice, as advisers to the Food and Drug Administration on Tuesday backed a more traditional type of shot.\r\nNex… [+5063 chars]"},{"publishedAt":"2022-06-18T16:39:04Z","author":null,"urlToImage":"https://www.energy.gov/sites/default/files/styles/photo_gallery_509_x_678_/public/2021-11/DOE%20Press%20Release%20Preview%20image.png?itok=dTcBeeaq","description":"Lennox’s Cold Climate Heat Pump Unlocks Potential for Domestic Manufacturing of Clean Energy Heating Products that Slash Energy Bills for Americans","source":{"name":"Energy.gov","id":null},"title":"Doe Announces Breakthrough in Residential Cold Climate Heat Pump Technology","url":"https://www.energy.gov/articles/doe-announces-breakthrough-residential-cold-climate-heat-pump-technology","content":"WASHINGTON, D.C.  The U.S. Department of Energy (DOE) today announced that American heat pump manufacturer Lennox International became the first partner in the U.S. Department of Energys (DOEs) Resid… [+3053 chars]"},{"publishedAt":"2022-06-24T16:34:08Z","author":"Pitchfork","urlToImage":"https://media.pitchfork.com/photos/62b5df04bafb1ab3d58afe45/16:9/w_1280,c_limit/Reproductive-Justice-Resources.jpg","description":"Here’s how to take action","source":{"name":"Pitchfork","id":null},"title":"Resources to Protect Reproductive Rights After the Overturn of Roe v. Wade","url":"https://pitchfork.com/news/resources-to-protect-reproductive-rights-after-the-overturn-of-roe-v-wade/","content":"This morning, the Supreme Court overturnedRoe v. Wade, ending nearly 50 years of the constitutional right to abortion. In an opinion reflecting the 6-3 majoritya draft of which had been leaked last m… [+3144 chars]"},{"publishedAt":"2022-06-14T17:55:45Z","author":"Timi Cantisano","urlToImage":"https://www.xda-developers.com/files/2022/06/instagramyouth.jpg","description":"Instagram will introduce a new feature that will “nudge” teens to move on from a subject that they might be fixated on. The notification will go live in certain countries and it will encourage teens to look at different topics when on the Explore page. The “n…","source":{"name":"XDA Developers","id":null},"title":"Instagram will help teens move on from content with a gentle nudge","url":"https://www.xda-developers.com/instagram-will-help-teens-move-on-from-content-with-a-gentle-nudge/","content":"Instagram will introduce a new feature that will “nudge” teens to move on from a subject that they might be fixated on. The notification will go live in certain countries and it will encourage teens … [+1742 chars]"}]