[{"publishedAt":"2022-07-06T11:00:00Z","author":null,"urlToImage":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/5/immigration-form--istock---alexskopje--1-5975328-1657051066770.jpg","description":"Canada's immigration department is restarting all Express Entry draws for immigration applications Wednesday, after pausing the program 18 months ago during the pandemic.","source":{"name":"Ctvnews.ca","id":null},"title":"Canada immigration: Express Entry draws for hopefuls resume - CTV News","url":"https://www.ctvnews.ca/canada/most-stressful-experience-express-entry-draws-resume-but-long-waits-take-toll-1.5975324","content":"Canada's immigration department is restarting its draws today for all programs under Express Entry -- a system used to select so-called economic immigrants -- after it temporarily shut down over the … [+12618 chars]"},{"publishedAt":"2022-06-20T11:02:15Z","author":"Katie Strang, Dan Robson, Ian Mendes","urlToImage":"https://cdn.theathletic.com/app/uploads/2022/06/19151947/JuniorHockeyCulture_Final.png","description":"Content warning: This story contains details about alleged sexual assault. The content may be difficult to read and emotionally upsetting.\nMultiple officials from Hockey Canada will be in Ottawa on Monday to testify in a Canadian parliamentary hearing in fron…","source":{"name":"The Athletic","id":null},"title":"‘We haven’t learned a damn thing’: Sexual violence is embedded in junior hockey culture - The Athletic","url":"https://theathletic.com/3373130/2022/06/20/sexual-violence-junior-hockey/","content":"Content warning: This story contains details about alleged sexual assault. The content may be difficult to read and emotionally upsetting.\r\nMultiple officials from Hockey Canada will be in Ottawa on … [+22210 chars]"},{"publishedAt":"2022-07-04T11:00:18Z","author":"Sofia Ali-Khan","urlToImage":"https://api.time.com/wp-content/uploads/2022/07/GettyImages-1235372034.jpg?quality=85&w=1024&h=628&crop=1","description":"This is a festive period for Muslims around the world. One Eid, or Muslim celebration, has just passed, and another is coming up in July. I’ve left strings of starry lights in the tall windows of our family room, where they can be seen twinkling from the stre…","source":{"name":"Time","id":"time"},"title":"Finding the American Dream in Canada","url":"https://time.com/6193327/finding-the-american-dream-in-canada/","content":"This is a festive period for Muslims around the world. One Eid, or Muslim celebration, has just passed, and another is coming up in July. I’ve left strings of starry lights in the tall windows of our… [+7852 chars]"},{"publishedAt":"2022-06-25T21:01:58Z","author":"Laura Osman","urlToImage":"https://www.cp24.com/polopoly_fs/1.5963223.1656190879!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","description":"Prime Minister Justin Trudeau is headed to the G7 in Germany Saturday without a consensus from the Commonwealth to condemn the Russian invasion of Ukraine, but with a chorus of countries calling for help to overcome the fallout of the war.","source":{"name":"CP24 Toronto's Breaking News","id":null},"title":"Commonwealth falls short of condemning Russia as Trudeau prepares for G7 - CP24 Toronto's Breaking News","url":"https://www.cp24.com/news/commonwealth-falls-short-of-condemning-russia-as-trudeau-prepares-for-g7-1.5963221","content":"Prime Minister Justin Trudeau is headed to the G7 in Germany Saturday without a consensus from the Commonwealth to condemn the Russian invasion of Ukraine, but with a chorus of countries calling for … [+3799 chars]"},{"publishedAt":"2022-06-23T12:07:53Z","author":"Melissa Mahtani, CNN","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220502222634-demonstrators-abortion-supreme-court-file-110121-super-tease.jpg","description":"Across every sphere, from health to the economy, security to social protection, the impacts of COVID-19 are exacerbated for women and girls simply by virtue of their sex.\"","source":{"name":"CNN","id":"cnn"},"title":"Post-pandemic plans: Five ways to make a gender equal recovery a reality","url":"https://www.cnn.com/2022/06/23/world/g7-summit-gender-equality-build-back-better-as-equals-intl-cmd/index.html","content":"This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)Across every sphere, from health to the… [+14158 chars]"}]