[{"publishedAt":"2022-06-09T14:18:03Z","author":"Cameron Greensmith","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/pride.jpg","description":"Pride parades were established to commemorate the strife experienced by gay men, lesbians, bisexuals and trans people at the 1969 Stonewall Riots in New York City's West Village. Parades worked their way into Canada to help celebrate queer life across two-spi…","source":{"name":"Phys.Org","id":null},"title":"Challenging the whiteness of queer organizations","url":"https://phys.org/news/2022-06-whiteness-queer.html","content":"Pride parades were established to commemorate the strife experienced by gay men, lesbians, bisexuals and trans people at the 1969 Stonewall Riots in New York City's West Village. Parades worked their… [+6700 chars]"},{"publishedAt":"2022-07-04T04:12:36Z","author":"Sheetal Banchariya","urlToImage":"https://images.indianexpress.com/2022/07/Tsinghua-University-1.jpg","description":"An analysis of the QS rankings and Times Higher Education (THE) rankings over ten years shows that only China has significantly increased its share of universities in the world's top 500","source":{"name":"The Indian Express","id":null},"title":"Despite language barrier, Chinese universities make huge gains in global rankings over the last decade","url":"https://indianexpress.com/article/education/despite-language-barrier-chinese-universities-make-huge-gains-global-rankings-last-decade-8007350/","content":"China has been steadily climbing the world university rankings over the past decade as it continues to promote policies that strengthen the performance of its high-potential institutions on ranking m… [+9114 chars]"},{"publishedAt":"2022-07-06T20:53:58Z","author":null,"urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","description":"COVID-19 vaccine acceptance increased 3.7% between 2020 and 2021, according to a new study. In a June 2021 survey of over 23,000 individuals across 23 countries, the researchers found that more than three-quarters (75.2%) of respondents reported vaccine accep…","source":{"name":"Science Daily","id":null},"title":"Study shows increase in COVID-19 vaccine acceptance around the world","url":"https://www.sciencedaily.com/releases/2022/07/220706165358.htm","content":"COVID-19 vaccine acceptance increased 3.7% between 2020 and 2021, according to a new study from researchers at the CUNY Graduate School of Public Health and Health Policy (CUNY SPH), the Barcelona In… [+3870 chars]"},{"publishedAt":"2022-06-11T08:00:00Z","author":"Yvette Brend","urlToImage":"https://i.cbc.ca/1.6480318.1654713252!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/iud-shutterstock.jpg","description":"A growing chorus of women are demanding better education and pain management for those who experience discomfort during the insertion of the tiny T-shaped birth control devices known as IUDs.","source":{"name":"CBC News","id":"cbc-news"},"title":"Women have sucked up the pain of birth control devices for decades, but do they have to?","url":"https://www.cbc.ca/radio/whitecoat/iud-pain-birth-control-1.6480281","content":"When she was in her late 20s, Katie O'Byrne heard about a newer product that promised to eliminate all pregnancy risk without needing to remember to take a birth control pill each day. \r\nBack in 2010… [+6688 chars]"},{"publishedAt":"2022-07-07T07:40:40Z","author":"Education Desk","urlToImage":"https://images.indianexpress.com/2022/07/Rajkumar-Ranjan-Singh.jpg","description":"Dr Rajkumar Ranjan Singh is hoping that India will be able to increase the number of international students studying in Indian universities from 50,000 currently to five lakh by the year 2024.","source":{"name":"The Indian Express","id":null},"title":"Aim to increase international students in India to 5 lakh in two years: Rajkumar Ranjan Singh","url":"https://indianexpress.com/article/education/aim-to-increase-international-students-in-india-to-5-lakh-in-two-years-rajkumar-ranjan-singh-at-chandigarh-university-8010853/","content":"India aims to increase the number of international students to at least five lakh in the next two years, said the Union Minister of State for External Affairs and Education Dr Rajkumar Ranjan Singh, … [+1330 chars]"}]