[{"publishedAt":"2022-06-27T14:01:50Z","author":null,"urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","description":"People are less morally outraged when gender discrimination occurs because of an algorithm rather than direct human involvement, according to new research.","source":{"name":"Science Daily","id":null},"title":"People less outraged by gender discrimination caused by algorithms","url":"https://www.sciencedaily.com/releases/2022/06/220627100150.htm","content":"People are less morally outraged when gender discrimination occurs because of an algorithm rather than direct human involvement, according to research published by the American Psychological Associat… [+2577 chars]"},{"publishedAt":"2022-06-09T14:18:03Z","author":"Cameron Greensmith","urlToImage":"https://scx2.b-cdn.net/gfx/news/hires/2022/pride.jpg","description":"Pride parades were established to commemorate the strife experienced by gay men, lesbians, bisexuals and trans people at the 1969 Stonewall Riots in New York City's West Village. Parades worked their way into Canada to help celebrate queer life across two-spi…","source":{"name":"Phys.Org","id":null},"title":"Challenging the whiteness of queer organizations","url":"https://phys.org/news/2022-06-whiteness-queer.html","content":"Pride parades were established to commemorate the strife experienced by gay men, lesbians, bisexuals and trans people at the 1969 Stonewall Riots in New York City's West Village. Parades worked their… [+6700 chars]"},{"publishedAt":"2022-07-04T04:12:36Z","author":"Sheetal Banchariya","urlToImage":"https://images.indianexpress.com/2022/07/Tsinghua-University-1.jpg","description":"An analysis of the QS rankings and Times Higher Education (THE) rankings over ten years shows that only China has significantly increased its share of universities in the world's top 500","source":{"name":"The Indian Express","id":null},"title":"Despite language barrier, Chinese universities make huge gains in global rankings over the last decade","url":"https://indianexpress.com/article/education/despite-language-barrier-chinese-universities-make-huge-gains-global-rankings-last-decade-8007350/","content":"China has been steadily climbing the world university rankings over the past decade as it continues to promote policies that strengthen the performance of its high-potential institutions on ranking m… [+9114 chars]"},{"publishedAt":"2022-06-06T19:58:27Z","author":"Lori Grunin","urlToImage":"https://www.cnet.com/a/img/resize/4c73a8235c14c03c24c4b4d5792999dafade1160/2022/06/06/2e13f255-e835-45be-b9a1-2d6884c24af6/apple-macbook-air-2022-wwdc.png?auto=webp&fit=crop&height=630&width=1200","description":"Apple debuts its new operating systems, silicon and laptops, plus updates to platforms like CarPlay and SharePlay.","source":{"name":"CNET","id":null},"title":"Everything Apple Announced at WWDC 2022: iOS 16, MacBook Air With M2 and More - CNET","url":"https://www.cnet.com/tech/mobile/everything-apple-announced-at-wwdc-2022-ios-16-macbook-air-with-m2-and-more/","content":"This story is part of WWDC 2022, CNET's complete coverage from and about Apple's annual developers conference. \r\nApple's annual developer conference, WWDC, is where the company shows off the next ver… [+7251 chars]"},{"publishedAt":"2022-07-06T20:53:58Z","author":null,"urlToImage":"https://www.sciencedaily.com/images/scidaily-icon.png","description":"COVID-19 vaccine acceptance increased 3.7% between 2020 and 2021, according to a new study. In a June 2021 survey of over 23,000 individuals across 23 countries, the researchers found that more than three-quarters (75.2%) of respondents reported vaccine accep…","source":{"name":"Science Daily","id":null},"title":"Study shows increase in COVID-19 vaccine acceptance around the world","url":"https://www.sciencedaily.com/releases/2022/07/220706165358.htm","content":"COVID-19 vaccine acceptance increased 3.7% between 2020 and 2021, according to a new study from researchers at the CUNY Graduate School of Public Health and Health Policy (CUNY SPH), the Barcelona In… [+3870 chars]"}]