[{"publishedAt":"2022-06-30T13:00:37Z","author":"Mariella Moon","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/c9e06170-f86a-11ec-afff-6c16c2e1bd8e","description":"GM is training more first responders to be able to handle emergencies involving electric vehicles. The automaker is \"significantly expanding\" its EV First Responder Training program in the United States and Canada as electric vehicle sales continue to grow. I…","source":{"name":"Engadget","id":"engadget"},"title":"GM is training more first responders for EV emergencies in the US and Canada","url":"https://www.engadget.com/gm-training-more-first-responders-ev-emergencies-130037644.html","content":"GM is training more first responders to be able to handle emergencies involving electric vehicles. The automaker is \"significantly expanding\" its EV First Responder Training program in the United Sta… [+2184 chars]"},{"publishedAt":"2022-07-01T10:13:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/pf2fTXHUONfmgAD8GSZ1qHMIc8Q=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NGKJRMJ2MVLWVM56QANMEJ3E2U.jpg","description":"The first in-person Canada Day celebrations in three years on Friday will include a huge police presence and street closures throughout downtown Ottawa to prevent anti-government \"freedom\" protesters from disrupting the festivities.","source":{"name":"Reuters","id":"reuters"},"title":"Ottawa bracing for Canada Day anti-government protests - Reuters Canada","url":"https://www.reuters.com/world/americas/ottawa-bracing-canada-day-anti-government-protests-2022-07-01/","content":"OTTAWA, July 1 (Reuters) - The first in-person Canada Day celebrations in three years on Friday will include a huge police presence and street closures throughout downtown Ottawa to prevent anti-gove… [+2103 chars]"},{"publishedAt":"2022-06-26T08:32:49Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/4C92/production/_125620691_gettyimages-1239234785.jpg","description":"The move by the UK, US, Canada and Japan will \"strike at the heart of Putin's war machine\", the UK PM says.","source":{"name":"BBC News","id":"bbc-news"},"title":"Ukraine war: UK joins ban on imports of Russian gold","url":"https://www.bbc.co.uk/news/business-61941589","content":"The UK, US, Canada and Japan will ban imports of Russian gold in an effort to hit Moscow's ability to fund the war in Ukraine.\r\nThe UK said the measure would \"strike at the heart of Putin's war machi… [+1760 chars]"},{"publishedAt":"2022-06-27T18:24:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/Ww1vJw3Rp2jdkwbKL_gT56iarpk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/W74HJPJJSBJBJBLHQWVFZSCXTM.jpg","description":"Ottawa officials said on Monday they are closing roads and calling in reinforcements to keep anti-government \"freedom\" protesters from disrupting Canada Day festivities, which are being held for the first time in three years on Friday.","source":{"name":"Reuters","id":"reuters"},"title":"Ottawa police call in Canada Day reinforcements for 'freedom' protests - Reuters Canada","url":"https://www.reuters.com/world/americas/ottawa-police-call-canada-day-reinforcements-freedom-protests-2022-06-27/","content":"OTTAWA, June 27 (Reuters) - Ottawa officials said on Monday they are closing roads and calling in reinforcements to keep anti-government \"freedom\" protesters from disrupting Canada Day festivities, w… [+2144 chars]"},{"publishedAt":"2022-06-14T10:13:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=99","description":"Denmark and Canada will divide the small, uninhabited island in the Arctic known as Hans Island, ending an almost 50-year long ownership spat, in a largely symbolic act of diplomacy designed to avoid tensions in the high North.","source":{"name":"Reuters","id":"reuters"},"title":"Canada and Denmark divide small Arctic island, ending ownership dispute - Reuters Canada","url":"https://www.reuters.com/world/americas/canada-denmark-divide-small-arctic-island-ending-ownership-dispute-2022-06-14/","content":"COPENHAGEN, June 14 (Reuters) - Denmark and Canada will divide the small, uninhabited island in the Arctic known as Hans Island, ending an almost 50-year long ownership spat, in a largely symbolic ac… [+2544 chars]"}]