[{"publishedAt":"2022-06-27T18:24:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/Ww1vJw3Rp2jdkwbKL_gT56iarpk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/W74HJPJJSBJBJBLHQWVFZSCXTM.jpg","description":"Ottawa officials said on Monday they are closing roads and calling in reinforcements to keep anti-government \"freedom\" protesters from disrupting Canada Day festivities, which are being held for the first time in three years on Friday.","source":{"name":"Reuters","id":"reuters"},"title":"Ottawa police call in Canada Day reinforcements for 'freedom' protests - Reuters Canada","url":"https://www.reuters.com/world/americas/ottawa-police-call-canada-day-reinforcements-freedom-protests-2022-06-27/","content":"OTTAWA, June 27 (Reuters) - Ottawa officials said on Monday they are closing roads and calling in reinforcements to keep anti-government \"freedom\" protesters from disrupting Canada Day festivities, w… [+2144 chars]"},{"publishedAt":"2022-06-14T10:13:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=99","description":"Denmark and Canada will divide the small, uninhabited island in the Arctic known as Hans Island, ending an almost 50-year long ownership spat, in a largely symbolic act of diplomacy designed to avoid tensions in the high North.","source":{"name":"Reuters","id":"reuters"},"title":"Canada and Denmark divide small Arctic island, ending ownership dispute - Reuters Canada","url":"https://www.reuters.com/world/americas/canada-denmark-divide-small-arctic-island-ending-ownership-dispute-2022-06-14/","content":"COPENHAGEN, June 14 (Reuters) - Denmark and Canada will divide the small, uninhabited island in the Arctic known as Hans Island, ending an almost 50-year long ownership spat, in a largely symbolic ac… [+2544 chars]"},{"publishedAt":"2022-06-27T16:43:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/6oqp6GY4sWVx4GnC5GOb7w8qa24=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/QRPKRJAXQJPH5LI3Q5I7JF2OQA.jpg","description":"Canada on Monday announced more measures in response to Russia's invasion of Ukraine, including additional sanctions and a ban on the export of technologies that could help improve Russia's defense manufacturing capability.","source":{"name":"Reuters","id":"reuters"},"title":"Canada to impose additional sanctions, ban tech export to Russia -statement - Reuters Canada","url":"https://www.reuters.com/world/americas/canada-impose-additional-sanctions-ban-tech-export-russia-statement-2022-06-27/","content":"OTTAWA, June 27 (Reuters) - Canada on Monday announced more measures in response to Russia's invasion of Ukraine, including additional sanctions and a ban on the export of technologies that could hel… [+607 chars]"},{"publishedAt":"2022-06-06T17:00:36Z","author":"Jon Fingas","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/a5e6d8e0-e595-11ec-b52f-caf4646bfe89","description":"Google's newest Pixel feature drop is meant as much for spur-of-the-moment creativity as it is everyday conveniences. The company is rolling out a June feature update that, with a separate download, offers a free music-making tool from Teenage Engineering. Th…","source":{"name":"Engadget","id":"engadget"},"title":"Google's latest Pixel feature drop includes a Teenage Engineering music app","url":"https://www.engadget.com/google-pixel-feature-drop-june-release-170036620.html","content":"Google's newest Pixel feature drop is meant as much for spur-of-the-moment creativity as it is everyday conveniences. The company is rolling out a June feature update that, with a separate download, … [+1510 chars]"},{"publishedAt":"2022-06-14T16:13:53Z","author":null,"urlToImage":"https://www.tsn.ca/polopoly_fs/1.1809823!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/hockey-canada.jpg","description":"<ol><li>Hockey Canada says no government funds used in lawsuit settlement  TSN\r\n<\/li><li>Federal heritage committee votes to invite Hockey Canada officials to testify next week  Sportsnet.ca\r\n<\/li><li>Hockey Canada officials asked to testify at hearing on sex…","source":{"name":"Www.tsn.ca","id":null},"title":"Hockey Canada says no government funds used in lawsuit settlement - TSN","url":"https://www.tsn.ca/hockey-canada-says-no-government-funds-used-in-lawsuit-settlement-1.1812882","content":"Hockey Canada says it did not use government money to settle a lawsuit in which eight Canadian Hockey League players, including some members of Canadas 2017-18 World Junior team, were accused of sexu… [+2667 chars]"}]