[{"publishedAt":"2022-06-14T15:07:40Z","author":"Jacquie Gahagan, Full Professor and Associate Vice-President, Research, Mount Saint Vincent University, Denyse Rodrigues, Library Research & E-Learning Services Librarian, Mount Saint Vincent University","urlToImage":"https://images.theconversation.com/files/467576/original/file-20220607-16-ryt3uz.jpg?ixlib=rb-1.1.0&rect=0%2C96%2C4593%2C2296&q=45&auto=format&w=1356&h=668&fit=crop","description":"The Nova Scotia LGBT Seniors Archive and Lesbian Oral History Project focus on gathering stories from the generation that began using the term lesbian, and those who still can’t.","source":{"name":"The Conversation Africa","id":null},"title":"Older lesbians are the keepers of a rich history of the lives of women who love other women","url":"https://theconversation.com/older-lesbians-are-the-keepers-of-a-rich-history-of-the-lives-of-women-who-love-other-women-182310","content":"2SLGBTQQIA+ history cannot be complete without the stories of lesbian women. (Shutterstock)\r\nMany older lesbians sought out invisibility, they called each other “friends” or “career girls” or “not th… [+5734 chars]"},{"publishedAt":"2022-06-27T12:01:35Z","author":"ResearchBuzz","urlToImage":"https://s0.wp.com/i/blank.jpg","description":"NEW RESOURCES UCLA: New Online Mapping Tool Helps California Prepare for Extreme Heat. “The online mapping tool developed by UCLA and the Public Health Alliance of Southern California allows users to find […]","source":{"name":"Researchbuzz.me","id":null},"title":"California Heatwaves, WWII Facial Recognition, Archive File Formats, More: Monday ResearchBuzz, June 27, 2022","url":"https://researchbuzz.me/2022/06/27/california-heatwaves-wwii-facial-recognition-archive-file-formats-more-monday-researchbuzz-june-27-2022/","content":"NEW RESOURCES \r\nUCLA: New Online Mapping Tool Helps California Prepare for Extreme Heat. “The online mapping tool developed by UCLA and the Public Health Alliance of Southern California allows users … [+5931 chars]"},{"publishedAt":"2022-06-13T19:20:35Z","author":"Maria Iqbal - Staff Reporter","urlToImage":"https://images.thestar.com/7RwPXK0IZox2EsIpJjFxpSlp6ZA=/1200x800/smart/filters:cb(1655148035223):format(webp)/https://www.thestar.com/content/dam/thestar/news/canada/2022/06/08/is-tipping-spreading-or-dying-out-canadian-customers-see-both-happening/aviles_2.jpg","description":"Some quick-service spots introduce gratuities as other restaurants drop them and experts weigh in on whether to tap.","source":{"name":"Toronto Star","id":null},"title":"Is tipping spreading or dying out? Canadian customers see both happening","url":"https://www.thestar.com/news/canada/2022/06/08/is-tipping-spreading-or-dying-out-canadian-customers-see-both-happening.html","content":"Hassel Aviles think it’s time to tip our hats farewell to tipping.\r\n“You’re giving so much power to the guests, and often times it’s problematic,” says Aviles, who worked in front-line service for de… [+5751 chars]"},{"publishedAt":"2022-06-21T09:00:00Z","author":"Paul Withers","urlToImage":"https://i.cbc.ca/1.6495010.1655752615!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/boutlliers-pt-nova-scotia.JPG","description":"Tonnes of atmospheric measuring equipment are being flown to Sable Island for the fog project commissioned by the US Office of Naval Research.","source":{"name":"CBC News","id":"cbc-news"},"title":"Scientists hope to clear the air of fog mystery with Grand Banks mission","url":"https://www.cbc.ca/news/canada/nova-scotia/fog-study-grand-banks-sable-island-us-funded-1.6494970","content":"A major scientific field study of marine fog off the east coast of Canada is about to start.\r\nThe research is funded by the U.S. Department of Defense and hopes to better predict one of the most unpr… [+3819 chars]"},{"publishedAt":"2022-07-04T03:14:03Z","author":"Amanda Coletta","urlToImage":"https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1656676840","description":"The Canadian government won't turn away Americans seeking abortions, but long distances between clinics, providers stretched thin and difficulties with cross-border travel, it might not be much of a solution.","source":{"name":"Minneapolis Star Tribune","id":null},"title":"Barriers to abortion in Canada make it an unlikely haven for Americans","url":"https://www.startribune.com/barriers-to-abortion-in-canada-make-it-an-unlikely-haven-for-americans/600187484/","content":"TORONTO The Women's Health Clinic in Winnipeg is stretched. The facility is one of a handful of abortion clinics in Manitoba, a Canadian province of 1.3 million. It fields about 100 inquiries each we… [+7799 chars]"}]