[{"publishedAt":"2022-07-08T14:00:00Z","author":"Angelo S. Nyamtema, John C. LeBlanc, Godfrey Mtey, Gail Tomblin Murphy, Elias Kweyamba, Janet Bulemela, Allan Shayo, Zabron Abel, Omary Kilume, Heather Scott, Janet Rigby","urlToImage":"https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0271282.g003&size=inline","description":"Introduction In Tanzania, inadequate access to comprehensive emergency obstetric and newborn care (CEmONC) services is the major bottleneck for perinatal care and results in high maternal and perinatal mortality. From 2015 to 2019, the Accessing Safe Deliveri…","source":{"name":"Plos.org","id":null},"title":"Scale up and strengthening of comprehensive emergency obstetric and newborn care in Tanzania","url":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0271282","content":"Citation: Nyamtema AS, LeBlanc JC, Mtey G, Tomblin Murphy G, Kweyamba E, Bulemela J, et al. (2022) Scale up and strengthening of comprehensive emergency obstetric and newborn care in Tanzania. PLoS O… [+31515 chars]"},{"publishedAt":"2022-07-07T20:05:33Z","author":"Ctv Atlantic","urlToImage":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/7/pam-glode-desrochers-and-dr--young-1-5978608-1657223904606.jpg","description":"A new health care centre is opening in Halifax on Friday to help promote urban Indigenous wellness.","source":{"name":"Ctvnews.ca","id":null},"title":"Urban Indigenous health centre coming to Halifax","url":"https://atlantic.ctvnews.ca/urban-indigenous-health-centre-coming-to-halifax-1.5978604","content":"A new health care centre is opening in Halifax on Friday to help promote urban Indigenous wellness.\r\nThe innovative approach to health care delivery aims to help bridge gaps in health care for Indige… [+2918 chars]"},{"publishedAt":"2022-06-30T13:07:34Z","author":"Catherine Lévesque","urlToImage":"https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2022/06/Groundmeat.jpg","description":"New regulations will require that most foods containing more than 15 per cent of the recommended daily intake of sodium be labelled","source":{"name":"National Post","id":null},"title":"Health Canada backs down from nutrition warning labels for ground meat after criticism","url":"https://nationalpost.com/news/health-canada-backs-down-from-nutrition-warning-labels-for-ground-meat-after-criticism","content":"Article content\r\nHealth Canada will be exempting ground meat and poultry from the long-awaited stricter nutrition labelling regulations set to be in place by 2026, after previous consideration in the… [+2149 chars]"},{"publishedAt":"2022-06-13T23:47:24Z","author":"Breanna Karstens-smith","urlToImage":"https://globalnews.ca/wp-content/uploads/2022/06/beef.jpg?quality=85&strip=all&w=720&h=379&crop=1","description":"The Alberta government is calling the new Health Canada labelling on ground meat “scientifically baseless” saying it will drive up prices and hurt producers.","source":{"name":"Global News","id":null},"title":"Alberta fights new labelling on ground meat | Globalnews.ca","url":"https://globalnews.ca/news/8917950/alberta-fights-new-ground-beef-labelling/","content":"The Alberta government is calling new labelling on ground meat scientifically baseless.\r\nAgriculture Minister Nate Horner said Monday the move would drive up costs for consumers during a period of hi… [+2545 chars]"},{"publishedAt":"2022-07-07T18:05:24Z","author":"Alicia Draus","urlToImage":"https://globalnews.ca/wp-content/uploads/2022/07/health-centre.jpg?quality=85&strip=all&w=720&h=379&crop=1","description":"The clinic, which is located in the Friendship Centre, will begin accepting reservations on Friday with the first patient appointments scheduled for next Thursday.","source":{"name":"Global News","id":null},"title":"Mi’kmaw Native Friendship Centre opening Wije’winen Health Centre - Halifax | Globalnews.ca","url":"https://globalnews.ca/news/8973536/mikmaw-native-friendship-centre-opening-wijewinen-health-centre/","content":"A health clinic for the urban Indigenous population has been identified as a need for decades. Now it’s becoming a reality in Halifax.\r\n“So we’ve been looking for a while for an Indigenous doctor and… [+2264 chars]"}]