[{"publishedAt":"2022-07-06T04:03:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"Indian shares edged up on Wednesday, as strong quarterly performance from top non-banking financial company Bajaj finance boosted financial stocks and a drop in crude prices eased inflation worries.","source":{"name":"Reuters","id":"reuters"},"title":"Indian shares rise as financials gain, inflation fears ease - Reuters.com","url":"https://www.reuters.com/markets/europe/indian-shares-rise-financials-gain-inflation-fears-ease-2022-07-06/","content":"BENGALURU, July 6 (Reuters) - Indian shares edged up on Wednesday, as strong quarterly performance from top non-banking financial company Bajaj finance boosted financial stocks and a drop in crude pr… [+962 chars]"},{"publishedAt":"2022-07-07T13:52:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/0vfjijxSP0tr7RcZN9sbPf3sWy8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/LH3B4F7JJRLVDNEJPIMTI6F6JM.jpg","description":"The Bank of England should be watching closely the way that the recent fall in the value of the pound is feeding into the country's high inflation rate, BoE policymaker Catherine Mann said on Thursday.","source":{"name":"Reuters","id":"reuters"},"title":"BoE needs \"heightened awareness\" of pound's inflation role - Mann - Reuters","url":"https://www.reuters.com/world/uk/boe-needs-heightened-awareness-pounds-inflation-role-mann-2022-07-07/","content":"LONDON, July 7 (Reuters) - The Bank of England should be watching closely the way that the recent fall in the value of the pound is feeding into the country's high inflation rate, BoE policymaker Cat… [+496 chars]"},{"publishedAt":"2022-07-07T15:32:23Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220707&i=OV025707072022RP1&r=OV025707072022RP1&t=2","description":"Foreign visitors are flocking back to Greece's islands and ancient monuments, raising hopes for its vital tourism industry after a turbulent two years. But the impact of high inflation means a return to normal may still be some way off. Julian Satterthwaite r…","source":{"name":"Reuters","id":"reuters"},"title":"Greece tourism revives, now inflation is the worry - Reuters","url":"https://www.reuters.com/video/watch/idOV025707072022RP1","content":"Posted \r\nForeign visitors are flocking back to Greece's islands and ancient monuments, raising hopes for its vital tourism industry after a turbulent two years. But the impact of high inflation means… [+75 chars]"},{"publishedAt":"2022-07-07T15:48:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/zSMsIN6xQsG68Uz30LXy8Sw4Sj4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WBQKG5P2QZNM3LVWC4IMEZFGQM.jpg","description":"The French government's new inflation-relief package will cost 20 billion euros ($20.35 billion), but will not impact the overall public sector budget deficit, government sources said on Thursday.","source":{"name":"Reuters","id":"reuters"},"title":"French inflation-relief package to cost 20 bln euros - Reuters","url":"https://www.reuters.com/markets/europe/french-inflation-relief-package-cost-20-bln-euros-2022-07-07/","content":"PARIS, July 7 (Reuters) - The French government's new inflation-relief package will cost 20 billion euros ($20.35 billion), but will not impact the overall public sector budget deficit, government so… [+527 chars]"},{"publishedAt":"2022-06-11T08:00:00Z","author":"MarketBeat Staff","urlToImage":"https://assets.entrepreneur.com/providers/marketbeat/hero-image-marketbeat-429319.jpeg","description":"Inflation came in hotter than expected in May, as food, energy, and shelter costs put upward pressure on prices. Inflation has been high for the year and could continue to...","source":{"name":"Entrepreneur","id":null},"title":"Consider These Dividend-Paying Stocks During Inflationary Times","url":"https://www.entrepreneur.com/article/429319","content":"Inflation came in hotter than expected in May, as food, energy, and shelter costs put upward pressure on prices. Inflation has been high for the year and could continue to run on the high side for se… [+4426 chars]"}]