[{"publishedAt":"2022-06-15T18:04:28Z","author":"Nicole Goodkind, CNN Business","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/220614142346-04-jerome-powell-fed-interest-rates-file-restricted-super-tease.jpg","description":"The Federal Reserve raised interest rates by three-quarters of a percentage point on Wednesday in an aggressive move to tackle white-hot inflation that is plaguing the economy, frustrating consumers and stifling the Biden administration.","source":{"name":"CNN","id":"cnn"},"title":"Fed makes aggressive move to tackle white-hot inflation","url":"https://www.cnn.com/2022/06/15/economy/fed-rate-hike-decision-june/index.html","content":"Washington, DC (CNN)The Federal Reserve raised interest rates by three-quarters of a percentage pointon Wednesday in an aggressive move to tackle white-hot inflation that is plaguing the economy, fru… [+3162 chars]"},{"publishedAt":"2022-06-13T03:45:51Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/A10B/production/_125372214_gettyimages-1167016662.jpg","description":"It comes as official figures showed that US inflation hit a more than 40-year high last month.","source":{"name":"BBC News","id":"bbc-news"},"title":"Cost of living: Stock markets slide over global economy concerns","url":"https://www.bbc.co.uk/news/business-61779615","content":"By Peter HoskinsBusiness reporter\r\nAsian stock markets have fallen sharply as soaring prices in America triggered fears the Federal Reserve will take tougher action to rein in inflation.\r\nAt the same… [+2591 chars]"},{"publishedAt":"2022-07-05T07:00:14Z","author":"Katie Glueck","urlToImage":"https://static01.nyt.com/images/2022/06/30/multimedia/00pol-abortion-moderates-meneely/00pol-abortion-moderates-meneely-facebookJumbo-v2.jpg","description":"Worried about inflation and dissatisfied with President Biden, many moderate women have been drifting away from Democrats. Now the party hopes the fight for abortion rights will drive them back.","source":{"name":"New York Times","id":null},"title":"Will the Abortion Debate Keep Moderate Women in the Democrats’ Camp?","url":"https://www.nytimes.com/2022/07/05/us/politics/abortion-roe-midterm-elections-moderate-women.html","content":"Another survey from Morning Consult and Politico found that among suburban voters, around 60 percent said it was very or somewhat important to support a candidate in the midterm elections who backs a… [+1419 chars]"},{"publishedAt":"2022-06-24T23:37:12Z","author":"Katie Glueck","urlToImage":"https://static01.nyt.com/images/2022/06/24/multimedia/00pol-abortion-anti/00pol-abortion-anti-facebookJumbo.jpg","description":"Democrats hope the fall of Roe v. Wade will jolt abortion rights supporters into action in midterm elections. But is it enough to turn voters’ attention away from inflation?","source":{"name":"New York Times","id":null},"title":"Supreme Court’s Abortion Decision Roils Midterm Elections","url":"https://www.nytimes.com/2022/06/24/us/politics/abortion-roe-wade-midterm-elections.html","content":"It wont distract voters from unaffordable prices, rising crime or the border crisis, he said.\r\nWhen asked for comment, Jesse Hunt, a spokesman for the Republican Governors Association, responded in a… [+1385 chars]"},{"publishedAt":"2022-06-10T08:32:19Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220609&i=RCV00B5AI&r=RCV00B5AI&t=2","description":"Interest rates in the developed world lag far behind rising prices. That’s sent savers flocking to traditional safe havens to preserve their capital. Edward Chancellor says emerging-market currencies may prove to be the “least dirty shirt” for investors.","source":{"name":"Reuters","id":"reuters"},"title":"Breakout: Escaping inflation - Reuters.com","url":"https://www.reuters.com/video/watch/idRCV00B5AI","content":"Posted \r\nInterest rates in the developed world lag far behind rising prices. Thats sent savers flocking to traditional safe havens to preserve their capital. Edward Chancellor says emerging-market cu… [+60 chars]"}]