[{"publishedAt":"2022-07-01T07:23:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/0Hfk7ZG7JRXrgTnZQweVWbuZN2A=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/IM2EB6ZA6FOSVFIMPRIVMCYZ4Y.jpg","description":"European shares fell on Friday, with semiconductor stocks leading the slide following tepid outlook from U.S. memory-chip firm Micron Technology, while investors awaited euro zone inflation data for clues on the pace of interest rate hikes.","source":{"name":"Reuters","id":"reuters"},"title":"Chipmakers drag European equities lower ahead of inflation data - Reuters","url":"https://www.reuters.com/markets/europe/chipmakers-drag-european-equities-lower-ahead-inflation-data-2022-07-01/","content":"July 1 (Reuters) - European shares fell on Friday, with semiconductor stocks leading the slide following tepid outlook from U.S. memory-chip firm Micron Technology, while investors awaited euro zone … [+1293 chars]"},{"publishedAt":"2022-07-05T03:28:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/nhTiaH0s_COZvq76HXOQXJUbixY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3HJS75YMYFMFJGRA4LZJLC4ADY.jpg","description":"Asian shares inched up on Tuesday morning as positive economic data and hints of easing Sino-U.S. tensions offered some respite to the recent sell-offs, though persistent fears about a global recession and sky-high inflation kept most buyers at bay.","source":{"name":"Reuters","id":"reuters"},"title":"Asia stocks edge higher; growth, inflation fears check gains - Reuters.com","url":"https://www.reuters.com/markets/europe/global-markets-wrapup-1-2022-07-05/","content":"HONG KONG, July 5 (Reuters) - Asian shares inched up on Tuesday morning as positive economic data and hints of easing Sino-U.S. tensions offered some respite to the recent sell-offs, though persisten… [+2958 chars]"},{"publishedAt":"2022-07-09T02:36:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/9ZtR9R_mAY5scznRWDIaATce3EQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PBRMH7SN4VLWFMNW2C377Q23EU.jpg","description":"China's factory-gate inflation cooled in June to the lowest in 15 months, as strict anti-COVID measures hit demand and global recession fears triggered a selloff in ferrous metals, while consumer inflation rose to the highest in nearly two years.","source":{"name":"Reuters","id":"reuters"},"title":"China's June factory inflation cools, consumer prices accelerate - Reuters","url":"https://www.reuters.com/markets/europe/chinas-june-factory-inflation-cools-consumer-prices-accelerate-2022-07-09/","content":"BEIJING, July 9 (Reuters) - China's factory-gate inflation cooled in June to the lowest in 15 months, as strict anti-COVID measures hit demand and global recession fears triggered a selloff in ferrou… [+2131 chars]"},{"publishedAt":"2022-06-12T16:47:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/wQsFu-pT9R_7e4Zs4wl7wAkzRKg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/HQ2E2O7KDJJ6PEBYRCFKEP22IE.jpg","description":"The head of a high-profile Turkish private research group that calculates the country's inflation as being twice the official rate is facing a disciplinary inquiry at his job in an Istanbul-based university.","source":{"name":"Reuters","id":"reuters"},"title":"Turkish inflation research group lead faces disciplinary inquiry - Reuters","url":"https://www.reuters.com/world/middle-east/turkish-inflation-research-group-lead-faces-disciplinary-inquiry-2022-06-12/","content":"ISTANBUL, June 12 (Reuters) - The head of a high-profile Turkish private research group that calculates the country's inflation as being twice the official rate is facing a disciplinary inquiry at hi… [+1924 chars]"},{"publishedAt":"2022-06-10T03:14:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/JkRTAebPH_QiZaGZhj5UQ6oy3XY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/BENOIFUOZ5L6NOIBRUZC3DMI4E.jpg","description":"India's retail inflation likely slipped modestly in May, but stayed well above the Reserve Bank of India's upper tolerance limit for a fifth consecutive month, as lower fuel prices offset surging food costs, a Reuters poll found.","source":{"name":"Reuters","id":"reuters"},"title":"India's retail inflation likely slipped only modestly in May - Reuters.com","url":"https://www.reuters.com/markets/europe/indias-retail-inflation-likely-slipped-only-modestly-may-2022-06-10/","content":"BENGALURU, June 10 (Reuters) - India's retail inflation likely slipped modestly in May, but stayed well above the Reserve Bank of India's upper tolerance limit for a fifth consecutive month, as lower… [+2509 chars]"}]