[{"publishedAt":"2022-06-23T16:00:00Z","author":null,"urlToImage":"https://mma.prnewswire.com/media/1845584/VidCruiter_Recruitment_Platform_by_VidCruiter_Now_Available_on_S.jpg?p=facebook","description":"By integrating with SAP® SuccessFactors® Recruiting, VidCruiter's Video Interviewing Integration platform allows customers to invite candidates to VidCruiter video interviews, reference checks, skills tests, and much more MONCTON, NB, June 23, 2022 /PRNewswir…","source":{"name":"PRNewswire","id":null},"title":"Recruitment Platform by VidCruiter Now Available on SAP® Store","url":"https://www.prnewswire.com/news-releases/recruitment-platform-by-vidcruiter-now-available-on-sap-store-301573492.html","content":"\"While managing talent falls under the umbrella of HR, its impact is felt across the entire organization,\" said JF Poirier, Director of Strategic Partnerships at VidCruiter. \"Leveraging the latest te… [+2760 chars]"},{"publishedAt":"2022-07-09T08:34:47Z","author":"Mollie Walker","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2022/07/Adam-Sykora.jpg?quality=75&strip=all&w=1024","description":"Maybe it just worked out this way, but the Rangers used half of their six picks in rounds 2-6 of the 2022 NHL Draft at Bell Centre on Friday on centers.","source":{"name":"New York Post","id":null},"title":"Rangers focus on center position on Day 2 of NHL draft","url":"https://nypost.com/2022/07/09/rangers-focus-on-center-position-on-day-2-of-nhl-draft/","content":"MONTREAL Maybe it just worked out this way, but the Rangers used half of their six picks in rounds 2-6 of the 2022 NHL Draft at Bell Centre on Friday on centers which is coincidentally the position t… [+5843 chars]"},{"publishedAt":"2022-06-16T18:15:19Z","author":"CBC Sports","urlToImage":"https://i.cbc.ca/1.6491127.1655400431!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dorris-danielle-061622.jpg","description":"A pair of Canadians will share the podium at the Para swimming world championships. Danielle Dorris won gold in a championship-record time of 34.01 seconds, while Tess Routliffe added bronze in 35.40 seconds in the women's S7 50-metre butterfly event on Thurs…","source":{"name":"CBC News","id":"cbc-news"},"title":"Canada's Dorris speeds to gold, Routliffe adds bronze at Para swimming worlds","url":"https://www.cbc.ca/sports/paralympics/summer/para-swimming/para-swimming-world-championships-june16-1.6491074","content":"Canadians collected a medal of each colour at the Para swimming world championships on Thursday.\r\nDanielle Dorris won gold in a championship-record time of 34.01 seconds, while Tess Routliffe added b… [+3590 chars]"},{"publishedAt":"2022-06-25T10:00:44Z","author":"Hannah Rudderham","urlToImage":"https://i.cbc.ca/1.4148875.1496789867!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/university-of-moncton.jpg","description":"A New Brunswick program that allowed people who were eligible for employment insurance benefits to access them while at university or in other training full time was quietly dropped this week.","source":{"name":"CBC News","id":"cbc-news"},"title":"Student EI program stopped, students in 'disbelief'","url":"https://www.cbc.ca/news/canada/new-brunswick/student-ei-program-stopped-1.6500802","content":"Eve Chamberlain didn't know the EI program for students was stopped until her friend called her in tears. \r\n\"It felt like the government was making it even harder for me to be able to go to universit… [+5871 chars]"},{"publishedAt":"2022-06-10T13:18:38Z","author":"The Canadian Press","urlToImage":"https://www.thestar.com/assets/img/thestar-ribbon.png","description":"OTTAWA - The national unemployment rate was 5.1 per cent in May. Statistics Canada also released seasonally adjusted, three-month moving average unemp...","source":{"name":"Toronto Star","id":null},"title":"Here’s a quick glance at unemployment rates for May, by Canadian city","url":"https://www.thestar.com/business/2022/06/10/heres-a-quick-glance-at-unemployment-rates-for-may-by-canadian-city.html","content":"OTTAWA - The national unemployment rate was 5.1 per cent in May. Statistics Canada also released seasonally adjusted, three-month moving average unemployment rates for major cities. It cautions, howe… [+1828 chars]"}]