[{"publishedAt":"2022-07-05T04:29:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/E_uCW_f0e9ZMRhNoyROkphcHZDQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/SC3L5IQJS5ILRJ7BUCZLBU3FSY.jpg","description":"Saudi Arabia's non-oil private sector expanded in June at its fastest pace since September as demand continued to rise strongly despite the highest inflation in nearly two years, a survey showed on Tuesday.","source":{"name":"Reuters","id":"reuters"},"title":"Saudi non-oil private sector gallops despite inflation -PMI - Reuters.com","url":"https://www.reuters.com/world/middle-east/saudi-non-oil-private-sector-gallops-despite-inflation-pmi-2022-07-05/","content":"DUBAI, July 5 (Reuters) - Saudi Arabia's non-oil private sector expanded in June at its fastest pace since September as demand continued to rise strongly despite the highest inflation in nearly two y… [+1720 chars]"},{"publishedAt":"2022-06-08T08:31:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/MyQoXqb9dWpL6iKgAwg0WFlRbOo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/FY4LMVEFAZMQTGMQWUH7KNJFGE.jpg","description":"Major stock markets in the Gulf rebounded on Wednesday after oil prices drifted higher on expectations of solid demand and low inventories.","source":{"name":"Reuters","id":"reuters"},"title":"Most Gulf bourses rebound tracking rising oil prices - Reuters","url":"https://www.reuters.com/markets/stocks/most-gulf-bourses-rebound-tracking-rising-oil-prices-2022-06-08/","content":"June 8 (Reuters) - Major stock markets in the Gulf rebounded on Wednesday after oil prices drifted higher on expectations of solid demand and low inventories.\r\nBrent crude futures for August had rise… [+1941 chars]"},{"publishedAt":"2022-06-15T18:32:32Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220615&i=OV511415062022RP1&r=OV511415062022RP1&t=2","description":"U.S. President Joe Biden on Wednesday demanded oil refining companies explain why they are not putting more gasoline on the market, sharply escalating his rhetoric against industry as he faces pressure over rising prices. This report produced by Freddie Joyne…","source":{"name":"Reuters","id":"reuters"},"title":"Biden demands oil companies explain lack of gas - Reuters.com","url":"https://www.reuters.com/video/watch/idOV511415062022RP1","content":"Posted \r\nU.S. President Joe Biden on Wednesday demanded oil refining companies explain why they are not putting more gasoline on the market, sharply escalating his rhetoric against industry as he fac… [+70 chars]"},{"publishedAt":"2022-06-17T11:28:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/zi323XdJpANWRTkbXJdboGQNrxg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/FJH7D35NYJOTDDNS3MOHMYOJGA.jpg","description":"Canada's main stock index was poised to open higher on Friday on gains in crude prices, but tracked its worst week since the pandemic-driven market rout in March 2020.","source":{"name":"Reuters","id":"reuters"},"title":"TSX futures bounce back as oil prices firm - Reuters","url":"https://www.reuters.com/markets/stocks/tsx-futures-bounce-back-oil-prices-firm-2022-06-17/","content":"June 17 (Reuters) - Canada's main stock index was poised to open higher on Friday on gains in crude prices, but tracked its worst week since the pandemic-driven market rout in March 2020.\r\nSeptember … [+2008 chars]"},{"publishedAt":"2022-06-20T13:06:49Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220620&i=OV604420062022RP1&r=OV604420062022RP1&t=2","description":"China's crude oil imports from Russia soared 55% from a year earlier to a record level in May, displacing Saudi Arabia as the top supplier, as refiners cashed in on discounted supplies amid sanctions on Moscow over its invasion of Ukraine. Francis Maguire rep…","source":{"name":"Reuters","id":"reuters"},"title":"Russian oil exports to China soar to record - Reuters","url":"https://www.reuters.com/video/watch/idOV604420062022RP1","content":"Posted \r\nChina's crude oil imports from Russia soared 55% from a year earlier to a record level in May, displacing Saudi Arabia as the top supplier, as refiners cashed in on discounted supplies amid … [+73 chars]"}]