[{"publishedAt":"2022-07-06T07:22:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"Fujairah Oil Industry Zone on Wednesday published the following inventory data for oil products for the week ended July 4, according to industry information service S&P Global Commodity Insights.","source":{"name":"Reuters","id":"reuters"},"title":"UAE's Fujairah oil inventory data for week ended July 4 - Reuters.com","url":"https://www.reuters.com/business/energy/uaes-fujairah-oil-inventory-data-week-ended-july-4-2022-07-06/","content":"July 6 (Reuters) - Fujairah Oil Industry Zone on Wednesday published the following inventory data for oil products for the week ended July 4, according to industry information service S&amp;P Global … [+468 chars]"},{"publishedAt":"2022-07-06T10:34:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/ykL1XO_5TbExNlkBJsbIDAYQF6c=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WGS465SU55MGNNDRB63RLFGXM4.jpg","description":"India's palm oil imports in July are set to jump to the highest in 10 months because of a hefty correction in prices and as Indonesia allows more exports of the tropical oil, four dealers told Reuters.","source":{"name":"Reuters","id":"reuters"},"title":"India's July palm oil imports may surge to 10-month high as prices plunge - Reuters.com","url":"https://www.reuters.com/markets/commodities/indias-july-palm-oil-imports-may-surge-10-month-high-prices-plunge-2022-07-06/","content":"MUMBAI, July 6 (Reuters) - India's palm oil imports in July are set to jump to the highest in 10 months because of a hefty correction in prices and as Indonesia allows more exports of the tropical oi… [+2368 chars]"},{"publishedAt":"2022-07-06T08:16:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"China extended record imports of low-priced Russian crude oil into June despite a lockdown-induced slackening in its total crude oil imports, squeezing out supplies from the Middle East and West Africa, according to tanker trackers and traders.","source":{"name":"Reuters","id":"reuters"},"title":"China extends record imports of Russian oil into June, cuts Saudi supply - trade - Reuters.com","url":"https://www.reuters.com/business/energy/china-extends-record-imports-russian-oil-into-june-cuts-saudi-supply-trade-2022-07-06/","content":"SINGAPORE, July 6 (Reuters) - China extended record imports of low-priced Russian crude oil into June despite a lockdown-induced slackening in its total crude oil imports, squeezing out supplies from… [+4427 chars]"},{"publishedAt":"2022-07-06T14:48:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=101","description":"Croatia has lost an arbitration case initiated by Hungarian oil and gas company MOL over Croatia's failure to meet obligations under an agreement about its INA oil and gas company, Prime Minister Andrej Plenkovic said on Wednesday.","source":{"name":"Reuters","id":"reuters"},"title":"Croatia loses arbitration versus Hungary's MOL energy company - Reuters.com","url":"https://www.reuters.com/business/energy/croatia-loses-arbitration-versus-hungarys-mol-energy-company-2022-07-06/","content":"BELGRADE, July 6 (Reuters) - Croatia has lost an arbitration case initiated by Hungarian oil and gas company MOL over Croatia's failure to meet obligations under an agreement about its INA oil and ga… [+1668 chars]"},{"publishedAt":"2022-07-07T00:36:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/NFYzfTq62aZ3lnVuDnlDM3u4knQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/5GEZCTDG7FNX5OYMB23QPYUWCA.jpg","description":"Oil prices slipped in early Asian trade on Thursday, after hitting a nearly three-month low during the previous session, as fears of a potential global recession spurred concerns about oil demand.","source":{"name":"Reuters","id":"reuters"},"title":"Oil prices extend drop as recession fears cloud global demand outlook - Reuters.com","url":"https://www.reuters.com/markets/europe/oil-prices-extend-drop-recession-fears-cloud-global-demand-outlook-2022-07-07/","content":"July 7 (Reuters) - Oil prices slipped in early Asian trade on Thursday, after hitting a nearly three-month low during the previous session, as fears of a potential global recession spurred concerns a… [+1255 chars]"}]