[{"publishedAt":"2022-07-04T07:30:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/Zc2LHABL6c7FmqQvOoSjUAUaTsI=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WGNDCNT5NJKETP56E44M7KPCDQ.jpg","description":"UK's top share index rose on Monday, boosted by oil stocks as crude markets gained on concerns over tight supplies, with investors awaiting the earnings season to pick up pace to gauge the impact of surging prices and higher interest rates.","source":{"name":"Reuters","id":"reuters"},"title":"Oil stocks lift FTSE 100 as crude prices strengthen - Reuters.com","url":"https://www.reuters.com/markets/europe/oil-stocks-lift-ftse-100-crude-prices-strengthen-2022-07-04/","content":"July 4 (Reuters) - UK's top share index rose on Monday, boosted by oil stocks as crude markets gained on concerns over tight supplies, with investors awaiting the earnings season to pick up pace to g… [+1026 chars]"},{"publishedAt":"2022-07-04T08:59:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/mIa0L7BWQ308JamCvqr20Ykjmyk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/TWMP2G5O7VMTXJE6YIAF3GIPKM.jpg","description":"Oil edged lower on Monday as fears of a global recession that would hit demand overshadowed concerns of tight supply amid lower OPEC output, unrest in Libya and sanctions on Russia.","source":{"name":"Reuters","id":"reuters"},"title":"Oil slips as recession fears balance tight supply - Reuters.com","url":"https://www.reuters.com/business/energy/oil-slips-recession-fears-balance-tight-supply-2022-07-04/","content":"LONDON, July 4 (Reuters) - Oil edged lower on Monday as fears of a global recession that would hit demand overshadowed concerns of tight supply amid lower OPEC output, unrest in Libya and sanctions o… [+1642 chars]"},{"publishedAt":"2022-07-04T12:48:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"Investors continued to liquidate bullish long positions in petroleum last week as the economic outlook deteriorated though the rate of selling was much slower after heavy selling the week before.","source":{"name":"Reuters","id":"reuters"},"title":"Column: Oil bulls retreat as economic outlook darkens - Reuters.com","url":"https://www.reuters.com/markets/europe/oil-bulls-retreat-economic-outlook-darkens-2022-07-04/","content":"LONDON, July 4 (Reuters) - Investors continued to liquidate bullish long positions in petroleum last week as the economic outlook deteriorated though the rate of selling was much slower after heavy s… [+2131 chars]"},{"publishedAt":"2022-07-05T04:29:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/E_uCW_f0e9ZMRhNoyROkphcHZDQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/SC3L5IQJS5ILRJ7BUCZLBU3FSY.jpg","description":"Saudi Arabia's non-oil private sector expanded in June at its fastest pace since September as demand continued to rise strongly despite the highest inflation in nearly two years, a survey showed on Tuesday.","source":{"name":"Reuters","id":"reuters"},"title":"Saudi non-oil private sector gallops despite inflation -PMI - Reuters.com","url":"https://www.reuters.com/world/middle-east/saudi-non-oil-private-sector-gallops-despite-inflation-pmi-2022-07-05/","content":"DUBAI, July 5 (Reuters) - Saudi Arabia's non-oil private sector expanded in June at its fastest pace since September as demand continued to rise strongly despite the highest inflation in nearly two y… [+1720 chars]"},{"publishedAt":"2022-06-15T18:32:32Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220615&i=OV511415062022RP1&r=OV511415062022RP1&t=2","description":"U.S. President Joe Biden on Wednesday demanded oil refining companies explain why they are not putting more gasoline on the market, sharply escalating his rhetoric against industry as he faces pressure over rising prices. This report produced by Freddie Joyne…","source":{"name":"Reuters","id":"reuters"},"title":"Biden demands oil companies explain lack of gas - Reuters.com","url":"https://www.reuters.com/video/watch/idOV511415062022RP1","content":"Posted \r\nU.S. President Joe Biden on Wednesday demanded oil refining companies explain why they are not putting more gasoline on the market, sharply escalating his rhetoric against industry as he fac… [+70 chars]"}]