[{"publishedAt":"2022-06-09T19:46:12Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/3038/production/_125344321_7050f12d-847c-4aa2-b5f8-f85f28d0990f.jpg","description":"Russian president says oil and gas profits are increasing thanks to rising energy prices.","source":{"name":"BBC News","id":"bbc-news"},"title":"Putin: Russian energy embargo unlikely for years","url":"https://www.bbc.co.uk/news/world-europe-61752779","content":"Russian President Vladimir Putin says the West will not be able to cut itself off from Russian oil and gas for several years. \r\nHe added that nobody knows what might happen in that time, so Russian c… [+1772 chars]"},{"publishedAt":"2022-06-09T09:02:05Z","author":"Tariq Panja","urlToImage":"https://static01.nyt.com/images/2022/06/09/multimedia/09golf-phil/09golf-phil-facebookJumbo.jpg","description":"By promising top players multimillion-dollar paydays to join its new series, the oil-rich kingdom is attempting what amounts to a hostile takeover of a lucrative sport.","source":{"name":"New York Times","id":null},"title":"Saudi Arabia’s LIV Golf Series Upends Genteel World of Golf","url":"https://www.nytimes.com/2022/06/09/sports/golf/liv-golf-pga-tour.html","content":"Even the rare chances for LIV Series players to defend their decisions to reporters directly this week have often been tense. At a news conference on Wednesday, a group of players were asked if they … [+2052 chars]"},{"publishedAt":"2022-07-06T20:57:07Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/12660/production/_125806357_slovevacnewafp6jul22ok.jpg","description":"Civilians flee Ukraine's eastern city of Slovyansk and Kazakh oil is hit by a Russian court ruling.","source":{"name":"BBC News","id":"bbc-news"},"title":"Ukraine round-up: Evacuation under fire and new oil tensions","url":"https://www.bbc.co.uk/news/world-europe-62068417","content":"Residents have been told to leave Ukraine's eastern city of Slovyansk, a day after two people were killed in a Russian attack on a market.\r\nCivilians boarded minibuses on Wednesday morning as Russian… [+4281 chars]"},{"publishedAt":"2022-07-04T15:00:00Z","author":"Elizabeth Yuko","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/3c53330930a04da40eb208d8f2e42286.jpg","description":"Not only are window air conditioning units crucial for keeping cool during the hot summer months (at least for those who don’t have central AC), but they can also provide the soothing white noise some people like to have in the background while working or sle…","source":{"name":"Lifehacker.com","id":null},"title":"How to Stop Your AC Unit From Making All That Damn Noise","url":"https://lifehacker.com/how-to-stop-your-ac-unit-from-making-all-that-damn-nois-1849139683","content":"Not only are window air conditioning units crucial for keeping cool during the hot summer months (at least for those who dont have central AC), but they can also provide the soothing white noise some… [+2213 chars]"},{"publishedAt":"2022-06-20T11:52:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/qn8hxVyrLh_cJtWMF6huC1jZLbk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WIIXFFJAJFL27C3THS4CDQ4BNI.jpg","description":"Investors’ renewed bullishness toward oil prices was checked last week as central banks lifted interest rates and fears of an imminent recession sapping oil consumption intensified.","source":{"name":"Reuters","id":"reuters"},"title":"Column: Hedge fund oil bulls checked as interest rates rise: Kemp - Reuters","url":"https://www.reuters.com/business/energy/hedge-fund-oil-bulls-checked-interest-rates-rise-kemp-2022-06-20/","content":"LONDON, June 20 (Reuters) - Investors renewed bullishness toward oil prices was checked last week as central banks lifted interest rates and fears of an imminent recession sapping oil consumption int… [+2435 chars]"}]