[{"publishedAt":"2022-06-14T17:52:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=99","description":"Ecuador will prioritize companies with a good track record of working with local communities and possessing drilling technologies promoting sustainable mining when issuing new mining licenses, Energy Minister Xavier Vera said.","source":{"name":"Reuters","id":"reuters"},"title":"Ecuador to prioritize sustainable mining in new areas -minister - Reuters.com","url":"https://www.reuters.com/business/sustainable-business/ecuador-prioritize-sustainable-mining-new-areas-minister-2022-06-14/","content":"TORONTO, June 14 (Reuters) - Ecuador will prioritize companies with a good track record of working with local communities and possessing drilling technologies promoting sustainable mining when issuin… [+1478 chars]"},{"publishedAt":"2022-07-02T16:52:24Z","author":"The Canadian Press","urlToImage":"https://www.tsn.ca/polopoly_fs/1.1820330!/fileimage/httpImage/image.JPG_gen/derivatives/landscape_620/kevin-gausman.JPG","description":"<ol><li>Gausman exits start early after come-back ball to foot  TSN\r\n<\/li><li>Blue Jays in 60: Jays Can't Overcome Kevin Gausman Injury in First Game of Rays Doubleheader  SPORTSNET\r\n<\/li><li>Blue Jays starter Kevin Gausman pulled from second inning with inju…","source":{"name":"Www.tsn.ca","id":null},"title":"Gausman exits start early after come-back ball to foot - TSN","url":"https://www.tsn.ca/kevin-gausman-foot-injury-1.1820278","content":"TORONTO Blue Jays starter Kevin Gausman lay prone on the turf for several moments, scaring his teammates, opponents and Toronto fans early Saturday afternoon.\r\nThe 31-year-old was helped off the fiel… [+2066 chars]"},{"publishedAt":"2022-06-25T17:13:47Z","author":"David Welch, Danielle Bochove and Natalie Obiko Pearson / Bloomberg","urlToImage":"https://api.time.com/wp-content/uploads/2022/06/Canada.jpg?quality=85&w=1024&h=628&crop=1","description":"The Bloor West Village Women’s Clinic in Toronto has had very few American patients, despite advertising its abortion services internationally. That may be about to change.","source":{"name":"Time","id":"time"},"title":"With Roe v. Wade Overturned, Canada Could Become an Abortion Destination","url":"https://time.com/6191400/abortions-canada-roe/","content":"Bloomberg — The Bloor West Village Women’s Clinic in Toronto has had very few American patients, despite advertising its abortion services internationally. That may be about to change.\r\nThe US Suprem… [+5516 chars]"},{"publishedAt":"2022-07-07T23:19:00Z","author":"Joanna Lavoie","urlToImage":"https://www.cp24.com/polopoly_fs/1.5802513.1646240297!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","description":"<ol><li>'Sell first' says Toronto realtor as higher interest rates, rising inflation cool city's housing market  CP24 Toronto's Breaking News\r\n<\/li><li>Real estate agent: Many people 'desperate to sell right now'  CTV News\r\n<\/li><li>The latest on Delta's hous…","source":{"name":"CP24 Toronto's Breaking News","id":null},"title":"'Sell first' says Toronto realtor as higher interest rates, rising inflation cool city's housing market - CP24 Toronto's Breaking News","url":"https://www.cp24.com/news/sell-first-says-toronto-realtor-as-higher-interest-rates-rising-inflation-cool-city-s-housing-market-1.5978999","content":"As Toronto's once-hot real estate market continues to shows signs of cooling, one realtor says sellers are growing increasingly desperate.\"\r\nBrett Stein, of Torontos Stein Realty Group, said those lo… [+3423 chars]"},{"publishedAt":"2022-07-07T17:09:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=101","description":"Fund raising in Canadian capital markets plunged in the first half of 2022 as high interest rates and stock market volatility put the brakeson corporate plans to raise money.","source":{"name":"Reuters","id":"reuters"},"title":"Market volatility, rates push down Canadian fund raising - Reuters","url":"https://www.reuters.com/markets/deals/market-volatility-rates-push-down-canadian-fund-raising-2022-07-07/","content":"TORONTO, July 7 (Reuters) - Fund raising in Canadian capital markets plunged in the first half of 2022 as high interest rates and stock market volatility put the brakeson corporate plans to raise mon… [+1813 chars]"}]