[{"publishedAt":"2022-06-29T04:41:00Z","author":"Shane Goldmacher","urlToImage":"https://static01.nyt.com/images/2022/06/28/multimedia/28pol-ledeall-bailey-photo03/28pol-ledeall-bailey-photo03-facebookJumbo.jpg","description":"Democrats meddled to boost State Senator Darren Bailey in the G.O.P. primary for Illinois governor. But efforts to elevate far-right candidates in Colorado fizzled.","source":{"name":"New York Times","id":null},"title":"Illinois Governor’s Race Shows G.O.P.’s Lurch to Right (With Nudge From Left)","url":"https://www.nytimes.com/2022/06/28/us/politics/illinois-colorado-primaries.html","content":"Democrats had also attempted to meddle in the Republican primary for governor of Colorado, where an outside group spent money linking Greg Lopez, a former mayor of Parker, to Mr. Trump in a backhande… [+1154 chars]"},{"publishedAt":"2022-06-27T04:01:13Z","author":"Alexandra E. Petri","urlToImage":"https://static01.nyt.com/images/2022/06/26/sports/26titleix-soccer/26titleix-soccer-facebookJumbo.jpg","description":"After Title IX passed in 1972, administrators found soccer to be a cheap way to comply. And participation rates soared in high schools, universities and at club levels for girls and women.","source":{"name":"New York Times","id":null},"title":"Once an ‘Easy Way Out’ for Equality, Women’s Soccer Is Now a U.S. Force","url":"https://www.nytimes.com/2022/06/27/sports/soccer/title-ix-soccer.html","content":"Brooke Volza and the other girls who play in the top division of high school soccer in Albuquerque know all about the Metro Curse: The team that wins the citys metro tournament at the start of the se… [+927 chars]"},{"publishedAt":"2022-06-08T17:24:33Z","author":"Nicole Wetsman","urlToImage":"https://cdn.vox-cdn.com/thumbor/zknoGjwcxXifrAkBnVMaEk2Y8iU=/0x519:1306x1203/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23615092/Apple_WWDC22_watchOS_9_iPhone13Pro_Medications_schedules_220606_inline.jpg.large_2x.jpg","description":"Apple’s new medication alert feature on iPhone and Apple Watch could help some people remember to take needed drugs. But medication adherence is a hard problem to solve, and experts don’t know how much apps help improve health.","source":{"name":"The Verge","id":"the-verge"},"title":"Apple’s medication feature is a step in the right direction","url":"https://www.theverge.com/2022/6/8/23159517/apple-medication-reminder-iphone-watch-watchos-9-health-app","content":"Image: Apple\r\n\n \n\n Apple isn’t inventing anything new with its medication tracking feature for iPhone and Apple Watch, which the company announced as part of watchOS 9 at WWDC 2022 this week. There a… [+4337 chars]"},{"publishedAt":"2022-06-27T20:57:27Z","author":"Associated Press","urlToImage":"https://api.time.com/wp-content/uploads/2022/06/amtrak-train-derails-missouri.jpg?quality=85&w=1200&h=628&crop=1","description":"Three passengers were taken from the scene to University Hospital in Columbia, hospital spokesman Eric Maze said. He did not have information on their conditions.","source":{"name":"Time","id":"time"},"title":"Amtrak Train Carrying 243 People Derails in Missouri: Injuries Reported","url":"https://time.com/6191700/amtrak-train-derails-missouri/","content":"(MENDON, Mo.) — A passenger train traveling from Los Angeles to Chicago derailed in Missouri on Monday afternoon and initial reports indicate that some people aboard were injured, Amtrak said.\r\nThe S… [+714 chars]"},{"publishedAt":"2022-07-08T17:00:00Z","author":"Ashley GardnerProgram Manager, Jaqui HermanProgram Manager","urlToImage":"https://blog.google/static/blogv2/images/google-1000x1000.png","description":"In 2016, Dr. Anicia Peters discovered a problem. Dr. Peters, a researcher with the University of Namibia and chairperson of the Presidential Task Force on the Fourth Industrial Revolution, noticed that machine learning (ML) startups were not able to grow or s…","source":{"name":"Blog.google","id":null},"title":"Helping AI startups grow in Africa","url":"https://blog.google/around-the-globe/google-africa/helping-ai-startups-grow-in-africa/","content":"In 2016, Dr. Anicia Peters discovered a problem. Dr. Peters, a researcher with the University of Namibia and chairperson of the Presidential Task Force on the Fourth Industrial Revolution, noticed th… [+2818 chars]"}]