[{"publishedAt":"2022-06-16T22:12:56Z","author":"Eliza Fawcett","urlToImage":"https://static01.nyt.com/images/2022/06/16/us/16fla-abortion/16fla-abortion-facebookJumbo.jpg","description":"A South Florida congregation said that under Jewish law, abortion “is required if necessary to protect the health, mental or physical well-being” of a pregnant woman.","source":{"name":"New York Times","id":null},"title":"Synagogue Sues Florida, Saying Abortion Restrictions Violate Religious Freedoms","url":"https://www.nytimes.com/2022/06/16/us/florida-abortion-law-judaism.html","content":"To claim that my religion permits abortion, or that this statute addresses a point of religious disagreement, is not nearly enough, he wrote. It is not what your religion permits that is protected, b… [+1235 chars]"},{"publishedAt":"2022-06-22T22:59:02Z","author":"Blake Hounshell","urlToImage":"https://static01.nyt.com/images/2022/06/22/multimedia/22onpolitics-gas/22onpolitics-gas-facebookJumbo.jpg","description":"The president’s idea isn’t a new one. Republicans like Glenn Youngkin and Ron DeSantis got there first.","source":{"name":"New York Times","id":null},"title":"Biden Just Proposed a Gas Tax Holiday. Will It Work?","url":"https://www.nytimes.com/2022/06/22/us/politics/biden-just-proposed-a-gas-tax-holiday-will-it-work.html","content":"It was a Eureka moment.\r\nYoungkins team found a sympathetic grocery store owner, Tom Leonard, and secured his permission to film an ad in his wood-paneled store in Henrico County, in the suburbs nort… [+1219 chars]"},{"publishedAt":"2022-06-24T15:13:23Z","author":"Tammy La Gorce","urlToImage":"https://static01.nyt.com/images/2022/06/26/fashion/24VOWS-LGBTQACTIVIST1/24VOWS-LGBTQACTIVIST1-facebookJumbo.jpg","description":"Adam Topper and Jordan Manekin were set up in 2019 by two women they call “the yentas,” and later married by Senator Cory Booker.","source":{"name":"New York Times","id":null},"title":"What’s Two ‘Yentas’ Plus One Senator? A Lifetime Together.","url":"https://www.nytimes.com/2022/06/24/style/adam-topper-jordan-manekin-wedding.html","content":"Mr. Manekin, who left his job at the law firm in late 2021, is now working on a start-up business called Entente, which he said combines entertainment, finance and tech. Mr. Topper, who in 2021 compl… [+1247 chars]"},{"publishedAt":"2022-06-30T09:00:26Z","author":"Alanis Thames","urlToImage":"https://static01.nyt.com/images/2022/06/28/sports/28titleix-black-athletes1/28titleix-black-athletes1-facebookJumbo.jpg","description":"Title IX, over 50 years, has heavily benefited white women over nonwhite women. That’s partly because race has never been part of the law.","source":{"name":"New York Times","id":null},"title":"Equity in Sports Has Focused on Gender, Not Race. So Gaps Persist.","url":"https://www.nytimes.com/2022/06/30/sports/title-ix-race.html","content":"Its either not diverse because of socioeconomics, or its not diverse because of where the programming is, Kelly added.\r\nKelly added that she had not thought much about Title IX before she began worki… [+998 chars]"},{"publishedAt":"2022-06-16T15:55:39Z","author":"Catie Edmondson","urlToImage":"https://static01.nyt.com/images/2022/06/16/us/politics/16dc-gallows/16dc-gallows-facebookJumbo.jpg","description":"Little is known about how a gallows came to be built near the Capitol, but the motif has become a favorite among right-wing extremists and white supremacists.","source":{"name":"New York Times","id":null},"title":"‘So the Traitors Know the Stakes’: The Meaning of the Jan. 6 Gallows","url":"https://www.nytimes.com/2022/06/16/us/politics/jan-6-gallows.html","content":"In far-right circles, Mr. Simi said, mass violence directed toward your enemies is called for routinely. This is not something confined to the outer fringes.\r\nWhether the gallows erected on Jan. 6 wa… [+1148 chars]"}]