[{"publishedAt":"2022-06-29T14:41:42Z","author":"The Associated Press","urlToImage":"https://media.npr.org/assets/img/2022/06/29/ap22178632967929_wide-fbee93a6324959954207a1ba54a888e47ab02e73.jpg?s=1400","description":"The Nebraska native was a star quarterback for Omaha University before the Denver Broncos drafted him as a cornerback in the 14th round in 1968. He wasn't allowed to compete for the QB job in 1969.","source":{"name":"NPR","id":null},"title":"Marlin Briscoe, the 1st Black starting quarterback in the AFL, dies at 76","url":"https://www.npr.org/2022/06/29/1108557789/first-black-starting-quarterback-afl-marlin-briscoe-dies","content":"Marlin Briscoe (show in 1975), the first Black starting quarterback in the American Football League, died Monday.\r\nAnonymous/AP\r\nMarlin Briscoe, who became the first Black starting quarterback in the… [+4289 chars]"},{"publishedAt":"2022-07-05T03:58:52Z","author":null,"urlToImage":"https://s0.wp.com/i/blank.jpg","description":"I’m a professor, retiring at 62 because the Woke takeover of higher education has ruined academic life. “Another one?” you ask. “What does this guy have to say that hasn’t already been said by Jord…","source":{"name":"Josephhmanson.com","id":null},"title":"Why I’m Leaving the University","url":"https://josephhmanson.com/2022/07/04/why-im-leaving-the-university/","content":"Im a professor, retiring at 62 because the Woke takeover of higher education has ruined academic life. Another one? you ask. What does this guy have to say that hasnt already been said by JordanPeter… [+11262 chars]"},{"publishedAt":"2022-06-11T15:52:12Z","author":"Rick Rojas and Josh Peck","urlToImage":"https://static01.nyt.com/images/2022/06/10/us/00uvalde-bishop-2/00uvalde-bishop-2-facebookJumbo.jpg","description":"In South Texas, where guns are woven into the culture, Archbishop Gustavo García-Siller is urging his community to reconsider. “We have to!” he says.","source":{"name":"New York Times","id":null},"title":"In Uvalde, a Bishop Makes an Impassioned Plea: Tighten Gun Laws","url":"https://www.nytimes.com/2022/06/11/us/uvalde-archbishop-gun-reform.html","content":"Hes known as taking a more progressive, pro-immigrant type of stance, said Jacob Friesenhahn, who leads the religious studies program at Our Lady of the Lake University, a Catholic school in San Anto… [+1547 chars]"},{"publishedAt":"2022-07-03T15:34:00Z","author":"EditorDavid","urlToImage":"https://a.fsdn.com/sd/topics/crime_64.png","description":"Slashdot reader thegarbz writes: In 2019 Maastricht University in the Netherlands was hit with a ransomware attack which locked 25,000 staff and students out of their research data. The university agreed to pay a ransom of €200,000 to unlock the encrypted dat…","source":{"name":"Slashdot.org","id":null},"title":"School Recovers Ransomware Paid in Bitcoin - Makes a Profit","url":"https://yro.slashdot.org/story/22/07/03/1440256/school-recovers-ransomware-paid-in-bitcoin---makes-a-profit","content":"As part of an investigation into the cyberattack, Dutch police tracked down a bank account belonging to a money launderer in Ukraine, into which a relatively small amount of the ransom money — around… [+461 chars]"},{"publishedAt":"2022-06-17T16:11:58Z","author":"Jason Weisberger","urlToImage":"https://i0.wp.com/boingboing.net/wp-content/uploads/2022/05/shutterstock_1073463281.jpg?fit=1200%2C800&ssl=1","description":"From the \"no duh\" files, NORML offers information on a recent study of pot smoking and distracted driving. The study reveals that people who smoke pot on a daily basis drive better when under the influence than occasional users. \n\n\n\nNORML:\n\n\n\nInvestigators wi…","source":{"name":"Boing Boing","id":null},"title":"Frequent pot smokers perform better on distracted driving tests than occasional ones","url":"https://boingboing.net/2022/06/17/frequent-pot-smokers-perform-better-on-distracted-driving-tests-than-occasional-ones.html","content":"From the \"no duh\" files, NORML offers information on a recent study of pot smoking and distracted driving. The study reveals that people who smoke pot on a daily basis drive better when under the inf… [+1080 chars]"}]