[{"publishedAt":"2022-06-15T22:46:28Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220615&i=RCV00B62H&r=RCV00B62H&t=2","description":"A lawsuit against Binance over the collapse of stablecoin TerraUSD has the potential to change the way market participants engage with cryptocurrency platforms. Law Professors Carol Goforth of the University of Arkansas, V. Gerard Comizio of Washington Colleg…","source":{"name":"Reuters","id":"reuters"},"title":"Could lawsuit against Binance send crypto back to its decentralized finance roots? - Reuters.com","url":"https://www.reuters.com/video/watch/idRCV00B62H","content":"Posted \r\nA lawsuit against Binance over the collapse of stablecoin TerraUSD has the potential to change the way market participants engage with cryptocurrency platforms. Law Professors Carol Goforth … [+183 chars]"},{"publishedAt":"2022-07-08T09:09:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=101","description":"A sports fan and computer coder, Nigerian Victor Daniel became adept at soccer video games at university.","source":{"name":"Reuters","id":"reuters"},"title":"Nigerian soccer joins video game big league as local stars get avatars - Reuters.com","url":"https://www.reuters.com/lifestyle/sports/nigerian-soccer-joins-video-game-big-league-local-stars-get-avatars-2022-07-08/","content":"LAGOS, July 8 (Reuters) - A sports fan and computer coder, Nigerian Victor Daniel became adept at soccer video games at university.\r\nBut he grew frustrated that they showcased clubs and players from … [+1731 chars]"},{"publishedAt":"2022-06-22T16:44:36Z","author":"Kris Holt","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/2d35a420-f248-11ec-af3f-072a72c37fe7","description":"Researchers at Carnegie Mellon University have developed a camera system that can seemingly detect sound vibrations with a level of precision that makes it possible to recreate the audio without inference or a microphone. A team from CMU's School of Computer …","source":{"name":"Engadget","id":"engadget"},"title":"Researchers built a low-cost camera system that recreates sound from vibrations","url":"https://www.engadget.com/optical-microphone-camera-laser-carnegie-mellon-university-164436215.html","content":"Researchers at Carnegie Mellon University have developed a camera system that can seemingly detect sound vibrations with a level of precision that makes it possible to recreate the audio without infe… [+2094 chars]"},{"publishedAt":"2022-06-28T16:03:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"Taiwan's MediaTek Inc <a href=\"https://www.reuters.com/companies/2454.TW\" target=\"_blank\">(2454.TW)<\/a>, the world's fourth largest chip designer by revenue, plans to create a new design center in Indiana in partnership with Purdue University, the firm told R…","source":{"name":"Reuters","id":"reuters"},"title":"Taiwan's MediaTek pairs with Indiana's Purdue University for chip design center - Reuters","url":"https://www.reuters.com/technology/taiwans-mediatek-pairs-with-indianas-purdue-university-chip-design-center-2022-06-28/","content":"WASHINGTON, June 28 (Reuters) - Taiwan's MediaTek Inc (2454.TW), the world's fourth largest chip designer by revenue, plans to create a new design center in Indiana in partnership with Purdue Univers… [+1444 chars]"},{"publishedAt":"2022-06-08T20:17:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/Vf4o8QgvoCUMXf-IuYMxQYtdTl4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/R5WCZES5RROXDOMDXCB4ASDBGA.jpg","description":"Harvard President Lawrence Bacow said on Wednesday that he would leave his post in June 2023 after helping shepherd the nation's oldest university through the COVID pandemic.","source":{"name":"Reuters","id":"reuters"},"title":"Harvard University president says he will step down in 2023 - Reuters","url":"https://www.reuters.com/world/us/harvard-university-president-says-he-will-step-down-2023-2022-06-08/","content":"June 8 (Reuters) - Harvard President Lawrence Bacow said on Wednesday that he would leave his post in June 2023 after helping shepherd the nation's oldest university through the COVID pandemic.\r\nBaco… [+630 chars]"}]