[{"publishedAt":"2022-06-30T09:00:26Z","author":"Alanis Thames","urlToImage":"https://static01.nyt.com/images/2022/06/28/sports/28titleix-black-athletes1/28titleix-black-athletes1-facebookJumbo.jpg","description":"Title IX, over 50 years, has heavily benefited white women over nonwhite women. That’s partly because race has never been part of the law.","source":{"name":"New York Times","id":null},"title":"Equity in Sports Has Focused on Gender, Not Race. So Gaps Persist.","url":"https://www.nytimes.com/2022/06/30/sports/title-ix-race.html","content":"Its either not diverse because of socioeconomics, or its not diverse because of where the programming is, Kelly added.\r\nKelly added that she had not thought much about Title IX before she began worki… [+998 chars]"},{"publishedAt":"2022-06-16T15:55:39Z","author":"Catie Edmondson","urlToImage":"https://static01.nyt.com/images/2022/06/16/us/politics/16dc-gallows/16dc-gallows-facebookJumbo.jpg","description":"Little is known about how a gallows came to be built near the Capitol, but the motif has become a favorite among right-wing extremists and white supremacists.","source":{"name":"New York Times","id":null},"title":"‘So the Traitors Know the Stakes’: The Meaning of the Jan. 6 Gallows","url":"https://www.nytimes.com/2022/06/16/us/politics/jan-6-gallows.html","content":"In far-right circles, Mr. Simi said, mass violence directed toward your enemies is called for routinely. This is not something confined to the outer fringes.\r\nWhether the gallows erected on Jan. 6 wa… [+1148 chars]"},{"publishedAt":"2022-06-29T04:41:00Z","author":"Shane Goldmacher","urlToImage":"https://static01.nyt.com/images/2022/06/28/multimedia/28pol-ledeall-bailey-photo03/28pol-ledeall-bailey-photo03-facebookJumbo.jpg","description":"Democrats meddled to boost State Senator Darren Bailey in the G.O.P. primary for Illinois governor. But efforts to elevate far-right candidates in Colorado fizzled.","source":{"name":"New York Times","id":null},"title":"Illinois Governor’s Race Shows G.O.P.’s Lurch to Right (With Nudge From Left)","url":"https://www.nytimes.com/2022/06/28/us/politics/illinois-colorado-primaries.html","content":"Democrats had also attempted to meddle in the Republican primary for governor of Colorado, where an outside group spent money linking Greg Lopez, a former mayor of Parker, to Mr. Trump in a backhande… [+1154 chars]"},{"publishedAt":"2022-06-27T04:01:13Z","author":"Alexandra E. Petri","urlToImage":"https://static01.nyt.com/images/2022/06/26/sports/26titleix-soccer/26titleix-soccer-facebookJumbo.jpg","description":"After Title IX passed in 1972, administrators found soccer to be a cheap way to comply. And participation rates soared in high schools, universities and at club levels for girls and women.","source":{"name":"New York Times","id":null},"title":"Once an ‘Easy Way Out’ for Equality, Women’s Soccer Is Now a U.S. Force","url":"https://www.nytimes.com/2022/06/27/sports/soccer/title-ix-soccer.html","content":"Brooke Volza and the other girls who play in the top division of high school soccer in Albuquerque know all about the Metro Curse: The team that wins the citys metro tournament at the start of the se… [+927 chars]"},{"publishedAt":"2022-06-06T16:37:00Z","author":"Isaac Schultz","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/7623f642a14afa56c8fdae77fc9b1f46.jpg","description":"Japan’s education ministry says that more than 20 types of amino acids were detected in samples of an asteroid that were brought to Earth in December 2020, The Japan Times reports. The detection is the first evidence that amino acids exist on asteroids in spa…","source":{"name":"Gizmodo.com","id":null},"title":"Asteroid Samples Brought to Earth Contain Key Molecules for Life","url":"https://gizmodo.com/asteroid-samples-brought-to-earth-contain-key-molecules-1849022970","content":"Japans education ministry says that more than 20 types of amino acids were detected in samples of an asteroid that were brought to Earth in December 2020, The Japan Times reports. The detection is th… [+2751 chars]"}]