[{"publishedAt":"2022-06-07T11:00:00Z","author":"Jack McGovan","urlToImage":"https://media.wired.com/photos/629e962ee2f439bf18df71e1/191:100/w_1280,c_limit/meat_soybean_science_GettyImages-1233948808.jpg","description":"Scientists are using genomics to create high-protein soybeans and peas. Their aim? To make meat and milk substitutes that can rival the real thing.","source":{"name":"Wired","id":"wired"},"title":"The Secret to Tastier Fake Meat? Breeding Better Beans","url":"https://www.wired.com/story/meat-substitutes-breeding-better-beans/","content":"But this is only one part of the processwhats the point in developing new crops if they taste worse than whats already on the market? We have a trained tasting panel in-house that tastes our products… [+4323 chars]"},{"publishedAt":"2022-06-28T15:10:00Z","author":"Ed Cara","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/22391d9e49ebda531a193c2728c2df3d.jpg","description":"The first year of the pandemic in America saw a startling and disproportionate rise in maternal mortality, according to new research released Tuesday. In 2020, the study found, deaths during or soon after pregnancy rose even higher than the spike in mortality…","source":{"name":"Gizmodo.com","id":null},"title":"Maternal Deaths Spiked In US During First Year of the Pandemic, Study Finds","url":"https://gizmodo.com/pregnancy-deaths-pandemic-covid-study-cdc-1849117730","content":"The first year of the pandemic in America saw a startling and disproportionate rise in maternal mortality, according to new research released Tuesday. In 2020, the study found, deaths during or soon … [+4480 chars]"},{"publishedAt":"2022-06-16T22:12:56Z","author":"Eliza Fawcett","urlToImage":"https://static01.nyt.com/images/2022/06/16/us/16fla-abortion/16fla-abortion-facebookJumbo.jpg","description":"A South Florida congregation said that under Jewish law, abortion “is required if necessary to protect the health, mental or physical well-being” of a pregnant woman.","source":{"name":"New York Times","id":null},"title":"Synagogue Sues Florida, Saying Abortion Restrictions Violate Religious Freedoms","url":"https://www.nytimes.com/2022/06/16/us/florida-abortion-law-judaism.html","content":"To claim that my religion permits abortion, or that this statute addresses a point of religious disagreement, is not nearly enough, he wrote. It is not what your religion permits that is protected, b… [+1235 chars]"},{"publishedAt":"2022-06-22T22:59:02Z","author":"Blake Hounshell","urlToImage":"https://static01.nyt.com/images/2022/06/22/multimedia/22onpolitics-gas/22onpolitics-gas-facebookJumbo.jpg","description":"The president’s idea isn’t a new one. Republicans like Glenn Youngkin and Ron DeSantis got there first.","source":{"name":"New York Times","id":null},"title":"Biden Just Proposed a Gas Tax Holiday. Will It Work?","url":"https://www.nytimes.com/2022/06/22/us/politics/biden-just-proposed-a-gas-tax-holiday-will-it-work.html","content":"It was a Eureka moment.\r\nYoungkins team found a sympathetic grocery store owner, Tom Leonard, and secured his permission to film an ad in his wood-paneled store in Henrico County, in the suburbs nort… [+1219 chars]"},{"publishedAt":"2022-06-24T15:13:23Z","author":"Tammy La Gorce","urlToImage":"https://static01.nyt.com/images/2022/06/26/fashion/24VOWS-LGBTQACTIVIST1/24VOWS-LGBTQACTIVIST1-facebookJumbo.jpg","description":"Adam Topper and Jordan Manekin were set up in 2019 by two women they call “the yentas,” and later married by Senator Cory Booker.","source":{"name":"New York Times","id":null},"title":"What’s Two ‘Yentas’ Plus One Senator? A Lifetime Together.","url":"https://www.nytimes.com/2022/06/24/style/adam-topper-jordan-manekin-wedding.html","content":"Mr. Manekin, who left his job at the law firm in late 2021, is now working on a start-up business called Entente, which he said combines entertainment, finance and tech. Mr. Topper, who in 2021 compl… [+1247 chars]"}]