[{"publishedAt":"2022-07-05T21:28:27Z","author":"Neal E. Boudette","urlToImage":"https://static01.nyt.com/images/2022/07/05/multimedia/05nhl-grier3/05nhl-grier3-facebookJumbo.jpg","description":"Two days before the annual draft, Grier takes over a team in transition: San Jose missed the past three postseasons and recently fired its coach.","source":{"name":"New York Times","id":null},"title":"Sharks Hire Mike Grier as N.H.L.’s First Black General Manager","url":"https://www.nytimes.com/2022/07/05/sports/hockey/mike-grier-sharks-nhl.html","content":"The hiring is a significant milestone for the N.H.L., where Black players make up a small minority of the leagues rosters and occupy few front-office posts.\r\nGrier said he hoped his appointment would… [+1048 chars]"},{"publishedAt":"2022-06-15T04:34:00Z","author":"msmash","urlToImage":"https://a.fsdn.com/sd/topics/china_64.png","description":"China said its giant Sky Eye telescope may have picked up signs of alien civilizations, according to a report by the state-backed Science and Technology Daily, which then appeared to have deleted the report and posts about the discovery. From a report: The na…","source":{"name":"Slashdot.org","id":null},"title":"China Says It May Have Detected Signals From Alien Civilizations","url":"https://science.slashdot.org/story/22/06/15/0434213/china-says-it-may-have-detected-signals-from-alien-civilizations","content":"The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."},{"publishedAt":"2022-06-27T14:30:00Z","author":"Becca Lewis","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a58453d3e84c0538b18bab561bed895b.jpg","description":"Snakes often get a bad rap and sometimes with good reason—there are plenty of venomous snakes that are dangerous to pets and people in North America, including diamondback rattlesnakes, cottonmouths, and copperheads. In spite of their reputation, though, ther…","source":{"name":"Lifehacker.com","id":null},"title":"These Snakes Are Actually Great for Your Garden","url":"https://lifehacker.com/these-snakes-are-actually-great-for-your-garden-1849110406","content":"Snakes often get a bad rap and sometimes with good reasonthere are plenty of venomous snakes that are dangerous to pets and people in North America, including diamondback rattlesnakes, cottonmouths, … [+2932 chars]"},{"publishedAt":"2022-06-10T13:00:00Z","author":"Charlie Lewis","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bbbe838f1008691d6affbffd7d75aca0.jpg","description":"You were going for parent of the decade and saved enough in a 529 plan to fund your child’s private college education. Imagine your surprise when the little bugger decides not to go to college at all (or enrolls in a much less expensive school). Now there’s a…","source":{"name":"Lifehacker.com","id":null},"title":"All the Ways to Spend the Leftovers From Your Kid's 529 Savings","url":"https://lifehacker.com/all-the-ways-to-spend-the-leftovers-from-your-kids-529-1849039176","content":"You were going for parent of the decade and saved enough in a 529 plan to fund your childs private college education. Imagine your surprise when the little bugger decides not to go to college at all … [+2707 chars]"},{"publishedAt":"2022-07-05T19:45:00Z","author":"Kevin Hurler","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/5d9722000f166a65dcc8ef634d0f6c91.jpg","description":"A popular rocket fuel called RP-1 gets its name from its key ingredient: refined petroleum. Research published last week in the journal Joule suggests a potentially cleaner and more powerful ingredient: a molecule produced by the Streptomyces bacteria. The pr…","source":{"name":"Gizmodo.com","id":null},"title":"Microbes May Hold the Secret to Creating More Powerful Rocket Fuel","url":"https://gizmodo.com/microbes-produce-powerful-and-cleaner-rocket-fuel-1849142045","content":"A popular rocket fuel called RP-1 gets its name from its key ingredient: refined petroleum. Research published last week in the journal Joule suggests a potentially cleaner and more powerful ingredie… [+3339 chars]"}]