[{"publishedAt":"2022-06-12T16:47:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/wQsFu-pT9R_7e4Zs4wl7wAkzRKg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/HQ2E2O7KDJJ6PEBYRCFKEP22IE.jpg","description":"The head of a high-profile Turkish private research group that calculates the country's inflation as being twice the official rate is facing a disciplinary inquiry at his job in an Istanbul-based university.","source":{"name":"Reuters","id":"reuters"},"title":"Turkish inflation research group lead faces disciplinary inquiry - Reuters","url":"https://www.reuters.com/world/middle-east/turkish-inflation-research-group-lead-faces-disciplinary-inquiry-2022-06-12/","content":"ISTANBUL, June 12 (Reuters) - The head of a high-profile Turkish private research group that calculates the country's inflation as being twice the official rate is facing a disciplinary inquiry at hi… [+1924 chars]"},{"publishedAt":"2022-06-28T21:07:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/jIqF0-p-sTw7xMYJQDe0j9wxRRA=/728x381/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/FPX34MT35NMDJLDZENWIW7PLSU.jpg","description":"The University of Pennsylvania Carey Law School has said it will remove the name of a former U.S. Supreme Court chief justice who wrote a 1857 majority opinion upholding slavery from the exterior of a campus building.","source":{"name":"Reuters","id":"reuters"},"title":"Penn Law to remove name of controversial Supreme Court justice from building - Reuters.com","url":"https://www.reuters.com/legal/legalindustry/penn-law-remove-name-controversial-supreme-court-justice-building-2022-06-28/","content":"(Reuters) - The University of Pennsylvania Carey Law School has said it will remove the name of a former U.S. Supreme Court chief justice who wrote a 1857 majority opinion upholding slavery from the … [+2830 chars]"},{"publishedAt":"2022-06-23T17:17:00Z","author":null,"urlToImage":"https://www.reuters.com/resizer/ILs8UPrkPYd2CUfd7dRIVqLQREE=/728x381/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/VWV224OSDZOTPMFIQYJGNPYZNE.jpg","description":"Massachusetts' highest court on Thursday ruled that Harvard University can be sued for mistreating a descendent of slaves who were forced to be photographed for an 1850 study by a professor trying to prove the inferiority of Black people.","source":{"name":"Reuters","id":"reuters"},"title":"Harvard must face lawsuit over 'horrific' slave photos: Massachusetts court - Reuters","url":"https://www.reuters.com/world/us/harvard-must-face-lawsuit-over-horrific-slave-photos-massachusetts-court-2022-06-23/","content":"BOSTON, June 23 (Reuters) - Massachusetts' highest court on Thursday ruled that Harvard University can be sued for mistreating a descendent of slaves who were forced to be photographed for an 1850 st… [+2056 chars]"},{"publishedAt":"2022-06-24T08:37:33Z","author":"Reuters Editorial","urlToImage":"https://static.reuters.com/resources/r/?d=20220624&i=OV710824062022RP1&r=OV710824062022RP1&t=2","description":"China's Ambassador to Australia Xiao Qian was speaking at the University of Technology Sydney's Australia-China Relations Institute on Friday (24 June) when he was interrupted and heckled by several protesters holding signs reading \"Free Tibet\" and \"Free Hong…","source":{"name":"Reuters","id":"reuters"},"title":"Sydney protesters interrupt China envoy's speech - Reuters","url":"https://www.reuters.com/video/watch/idOV710824062022RP1","content":"Posted \r\nChina's Ambassador to Australia Xiao Qian was speaking at the University of Technology Sydney's Australia-China Relations Institute on Friday (24 June) when he was interrupted and heckled by… [+75 chars]"},{"publishedAt":"2022-06-25T11:46:00Z","author":null,"urlToImage":"https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=100","description":"An honorary doctorate awarded by a Swiss university to former Italian dictator Benito Mussolini will not be revoked despite being a \"serious mistake,\" a commission into the affair said.","source":{"name":"Reuters","id":"reuters"},"title":"Swiss university's academic award to Mussolini will not be revoked - Reuters","url":"https://www.reuters.com/world/europe/swiss-universitys-academic-award-mussolini-will-not-be-revoked-2022-06-25/","content":"ZURICH, June 25 (Reuters) - An honorary doctorate awarded by a Swiss university to former Italian dictator Benito Mussolini will not be revoked despite being a \"serious mistake,\" a commission into th… [+1439 chars]"}]