[{"publishedAt":"2022-07-03T12:00:00Z","author":"Jonathan O'Callaghan","urlToImage":"https://media.wired.com/photos/62bf2b4db3e9d5fb1d49e22b/191:100/w_1280,c_limit/Quanta_FeatureArt.jpg","description":"Robots will venture into the sunless depths of lunar craters to find ancient water ice, while studies find hints about how water arrives on rocky worlds.","source":{"name":"Wired","id":"wired"},"title":"Secrets of the Moon’s Permanent Shadows Are Coming to Light","url":"https://www.wired.com/story/secrets-of-the-moons-permanent-shadows-are-coming-to-light/","content":"On the eve of this new era of moon landings, a slew of fresh studies of PSRs have revealed that these shadowed regions are even stranger than scientists imagined. What will we find lurking in the sha… [+5063 chars]"},{"publishedAt":"2022-06-08T19:27:00Z","author":"Kevin Hurler","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/0d739d39e344a744e0bd2904af699a02.jpg","description":"Microplastics continue to infiltrate even the most remote parts of Earth. New research has identified tiny bits of plastic in the continent’s snowfall, likely arriving there from local sources, according to the team. These particles could enter the Antarctic …","source":{"name":"Gizmodo.com","id":null},"title":"Microplastics Found in Fresh Antarctic Snow","url":"https://gizmodo.com/microplastics-antarctica-fresh-snow-1849034006","content":"Microplastics continue to infiltrate even the most remote parts of Earth. New research has identified tiny bits of plastic in the continents snowfall, likely arriving there from local sources, accord… [+3173 chars]"},{"publishedAt":"2022-06-10T19:01:24Z","author":"Chris Stokel-Walker","urlToImage":"https://media.wired.com/photos/62a393d78eaf9419b31098a5/191:100/w_1280,c_limit/musk_sec_GettyImages-1395062612.jpg","description":"Twitter has reportedly given the billionaire access to its full stream of tweets and related user data. Is your privacy in jeopardy?","source":{"name":"Wired","id":"wired"},"title":"The Tricky Business of Elon Musk Getting Twitter Fire-Hose Access","url":"https://www.wired.com/story/elon-musk-twitter-firehose/","content":"Elon Musks never-ending attempt to take over Twitter has taken yet another weird turn as the social media platform appears to have acceded to the entrepreneurs request to gain access to a fire hose o… [+3082 chars]"},{"publishedAt":"2022-06-27T12:24:00Z","author":"Jonathan O'Callaghan","urlToImage":"https://media.wired.com/photos/62b6704dc36554390e65c980/191:100/w_1280,c_limit/Mars_Science_stsci-h-p1829d-m-2000x2000-(1).jpg","description":"Mars is littered with craters made by binary asteroids. These collisions are as intriguing as they are powerful.","source":{"name":"Wired","id":"wired"},"title":"Behold the Weird Physics of Double-Impact Asteroids","url":"https://www.wired.com/story/mars-binary-asteroid-craters/","content":"When an asteroid strikes a planet, it can pack a powerful punchas the dinosaurs discovered to their detriment 66 million years ago. But what if two asteroids strike at the same time and in the same l… [+3271 chars]"},{"publishedAt":"2022-06-11T11:00:00Z","author":"Chris Stokel-Walker","urlToImage":"https://media.wired.com/photos/62a398e1e1a7c9ca5f0da109/191:100/w_1280,c_limit/Johnny-Depp-Full-Circle-Meme-Business-1240778571.jpg","description":"TikTok played an integral role in his defamation trial—now Depp himself has joined the cacophony of memes.","source":{"name":"Wired","id":"wired"},"title":"Johnny Depp Has Become a Full-Circle Meme","url":"https://www.wired.com/story/johnny-depp-amber-heard-trial-tiktok/","content":"For the past nine weeks, Johnny Depp was TikTok. And TikTok was Johnny Depp. Now, after just one post thanking his fandom, his new account has more than 12 million followers. If the defamation suit t… [+3054 chars]"}]